[
    {
        "job_title": "House Cleaner - Up to $25/hr, Great Pay, Flexible Schedule + Tips",
        "job_location": "Guelph, ON",
        "job_salary": "$20–$25 an hour",
        "job_description": "House Cleaners Wanted!\nInspireClean - Guelph and Kitchener-Waterloo\nAre you a skilled and motivated cleaner looking for a rewarding opportunity? Look no further! InspireClean, a leading house cleaning service in Southern Ontario, is seeking high-quality independent contractors to join our dedicated team.\nWhy InspireClean?\nCompetitive Compensation: Starting wage of $20 per hour during a 2-week probationary period, with an increase to $22 afterward. Further increments to $23 after 6 months and $24-$25 after a year. Additionally, enjoy tips, a rewards program, and a gas bonus.\nFlexible Hours: Create your availability online and enjoy the freedom of setting your own schedule. Work around your other commitments and achieve a healthy work-life balance.\nIncentives for Excellence: At InspireClean, we believe in recognizing and rewarding outstanding performance. Earn additional rewards through our rewards program and receive a gas bonus for going above and beyond.\nMeaningful Work: Make a difference in the lives of our clients by providing exceptional cleaning services. Your attention to detail and dedication will help create clean and inspiring spaces for our customers to enjoy.\nMust-Haves:\n\nFluent English\nValid police background check\nDriver's license and reliable vehicle\nSmartphone and internet connection\nCleaning supplies\n\nWhat We're Looking For:\n- Cleaning experience and a passion for delivering top-notch service\n- Excellent attention to detail and time management skills\n- Ability to work independently and follow our cleaning protocols\n- Strong communication skills and a professional demeanor\nJoin our team of dedicated professionals who take pride in their work and enjoy the support of a reputable and growing company.\nInspireClean offers a positive work environment, continuous feedback and support, and opportunities for personal and professional growth.\nTo apply, submit your application via Indeed or visit our website at https://inspireclean.ca/house-cleaning-jobs and complete the online application form.\nDon't miss out on this exciting opportunity to be part of InspireClean's success story!\nJob Types: Full-time, Part-time, Permanent\nSalary: $20.00-$25.00 per hour\nExpected hours: 10 – 40 per week\nBenefits:\n\nCasual dress\nOn-site parking\n\nFlexible Language Requirement:\n\nFrench not required\n\nSchedule:\n\nDay shift\nEvening shift\nMonday to Friday\nOn call\nWeekends as needed\n\nSupplemental pay types:\n\nBonus pay\nTips\n\nApplication question(s):\n\nWhy do you feel you would make a good fit with InspireClean?\nAre you able to travel to service locations in Guelph and Kitchener-Waterloo?\nAre you able to provide your own cleaning supplies and equipment as required for the job?\nDo you work well in both solo and team settings?\n\nExperience:\n\nResidential cleaning: 2 years (preferred)\n\nLanguage:\n\nfluent English (preferred)\n\nLicence/Certification:\n\npolice background check (or able to obtain) (preferred)\ndriver's license and reliable vehicle (required)\n\nWork Location: On the road"
    },
    {
        "job_title": "Registered Massage Therapist",
        "job_location": "1453 Gordon St, Guelph, ON",
        "job_salary": "$75,000–$100,000 a year",
        "job_description": "Bodyworks RMT and Health Network has been in business since 2010, and as we continue to grow, are looking for another RMT to join our team!\nVarious Employment Options include: Subcontractor Status or Employee Status (NEW*).\nSIGNING BONUS: A successful candidate is eligible to earn a non-taxable signing bonus of between $500-$1000.00 pending the acceptance & fulfillment of a part-time or a full-time position.\nWhat to expect at Bodyworks:\n-flexible shifts options\n-full time office management, administrative and reception support.\n-predictable income & FULL schedule of patients. (RMT's are typically booked 98% of their bookable treatment time.)\n-guaranteed/predictable income if hired as an employee\n-generous & competitive earning power\n-fair, supportive, professional & empathetic management\n- Positive & upbeat work culture\n-teambuilding and collaborative support among team members\n-massage and chiropractic benefits\nLooking for a predictable career with steady hours, and a loyal returning patient base in massage therapy? Steadily throughout the year, we have an exceptionally loyal patient base where our team of RMT's has consistent and full schedules year round. We gladly work with our team members to develop a flexible schedule that suits their individuals needs and lifestyles.\nBodyworks Registered Massage Therapy and Chiropractic is an established health and wellness clinic that provides exceptional healthcare services to the Guelph Community and surrounding area. With over 14 years in the health industry, Bodyworks continues to grow rapidly, as does the need for exceptional individuals. We would love to hear from you!\nTo meet the needs of our growing patient base, Bodyworks is looking for a Registered Massage Therapist (RMT) to join its experienced and value driven healthcare professionals team. Whether you are looking for part-time or full-time position, a successful candidate will have an immediate, predictable, and steady client base due to the high traffic flow of our clinic and its loyal patient base.\nIf you are a Registered Massage Therapist (RMT) who has a massage therapy skill set, enjoys helping others and has gift in health and wellness, we would love to connect with you. Contact us today to see how we can help you grow a successful client base and continue to support our local community. All levels of experience welcomed, as training and mentorship is available.\n__Qualifications:\n\nSuccessful completion of MCQ/OSCE or plan to write it in the near future.\nHard working, ambitious, and friendly\nPoised, confident and professional\nA natural “people person”\nA passion for helping people improve their quality of life\nInterest in massage therapy and modalities within our scope, in addition to other aspects of living a healthy lifestyle and living well\nExcellent communication and organizational skills\nHighly responsible and reliable\nStrong interpersonal and problem solving abilities\n\nSalary:\nBased on a competitive hourly rate per treatment or a set hourly rate (employee status), RMT's have vast potential to increase earning power through our generous income tier system and/or employee wage structure. Depending on the RMT's individual skills and abilities, hourly rates range from $60.47 to $75.93.\nBodyworks provides the healthcare team the following:\n\nFull-time reception and Office Management\nFully furnished state of the art treatment rooms\nAll marketing services and materials provided\nUse of JaneApp clinic software (online patient / clinic bookable program)\nLinen service, massage oils and lotions\nUniform shirts\nWheelchair accessible facility\n\nResumes can be submitted by any of these avenues:\n\nIndeed\nemail\n\nWe look forward to hearing from you!\nwww.bodyworksrmt.com\n519-821-9483\nNOTE- applicants need not apply who do not have a valid license with the CMTO. \nJob Types: Full-time, Part-time, Permanent\nSalary: $75,000.00-$100,000.00 per year\nExpected hours: No less than 8 per week\nBenefits:\n\nCasual dress\nExtended health care\nFlexible schedule\nOn-site parking\nWellness program\n\nFlexible Language Requirement:\n\nFrench not required\n\nSchedule:\n\nDay shift\nEvening shift\nMonday to Friday\nMorning shift\nWeekends as needed\n\nSupplemental pay types:\n\nBonus pay\n\nLicence/Certification:\n\nMassage Therapist License (required)\n\nWork Location: In person"
    },
    {
        "job_title": "Chiropractor- Calgary",
        "job_location": "Ontario",
        "job_salary": "$75,000–$150,000 a year",
        "job_description": "Join the Largest Chiro-First Organization: Optimum Wellness Centres locate in Calgary and Greater Calgary Area. \nAre you a passionate and dedicated chiropractor looking to take your career to new heights?\nLook no further! Optimum Wellness Centres, the largest Chiro-First organization, is seeking experienced practitioners and new graduates to join our team.\nAs an independent contractor with Optimum Wellness Centres, chiropractors are the foundational leaders of our clinics. Our well-established multidisciplinary clinics feature fully operating administrative teams, allowing you to focus on what you do best- providing exceptional care to your patients.\nAt Optimum Wellness, we offer the opportunity for growth, with earn-in partnership capabilities within just 12 months and other reward upon signing. With 13 clinics in Calgary and the Greater Calgary Area, located in Canada's top city to live with a healthy economy and reasonable cost of living, you'll have ample opportunities to build your practice and make a meaningful impact on the community's health and well-being.\nWhether you're an experienced practitioner looking for a new challenge or a recent graduate eager to launch your career, we welcome you to join our dynamic team. At Optimum Wellness Centres, we're proud to be an equal opportunity organization. Join us in promoting equality and creating a brighter future for all as we work together to make a positive impact on our community's health and well-being. Apply now and become part of our inclusive and diverse team!\n\nQualifications:\n- Doctor of Chiropractic degree from an accredited institution- Valid provincial license to practice as a Chiropractor in Alberta, Canada or are able to qualify for licensing.- Strong knowledge of medical terminology and anatomy- Effective communication skills to educate and interact with patients- Compassionate and empathetic approach to patient care- Ability to work independently as well as a leader of a team\n\"Experience the vibrant economy, stunning natural landscapes, and unbeatable quality of life in Calgary – Canada's top city awaits your arrival!\"\n\nINDHP\nJob Types: Full-time, Part-time, Permanent\nSalary: $75,000.00-$150,000.00 per year\nExpected hours: 21 – 42 per week\nBenefits:\n\nCompany events\nExtended health care\nFlexible schedule\nOn-site parking\n\nFlexible Language Requirement:\n\nFrench not required\n\nSchedule:\n\n8 hour shift\nDay shift\nEvening shift\nMonday to Friday\nMorning shift\nWeekends as needed\n\nSupplemental pay types:\n\nRetention bonus\nSigning bonus\n\nApplication question(s):\n\nValid license to practice as a Chiropractor in Alberta, Canada?\n\nEducation:\n\nDoctoral Degree (required)\n\nWork Location: In person"
    },
    {
        "job_title": "Registered Practical Nurse (RPN) - Temp permanent nights and evenings",
        "job_location": "5016 Wellington 29 Rd, Guelph, ON",
        "job_salary": "$29.21–$32.25 an hour",
        "job_description": "If you’re considering a career move in the health care industry, Eden House Care Facility is the place to be! Having been open since 1968, Eden House stands as a pillar in the community for long term care. This is a small, family orientated long term care facility where a sense of community is present amongst staff and residents.\nEden House Care Facility is hiring a permanent Registered Practical Nurses (RPN) in Guelph, ON.\nAs a Registered Practical Nurses at Eden House Care Facility, you will use your clinical skills to ensure that our clients receive the highest quality home health care they need and deserve, delivered with compassion, excellence and reliability, in the comfort and safety of their homes.\nWe value our Eden House Nurses with:\n\nCompetitive industry wages for the critical work you do\nCompany sponsored Benefits (health and dental) for you and your family\nRetirement Savings Plan with a company contribution\nPaid sick days, paid orientation and paid training\nOpportunities to grow in your career\nEasy access to our strong leadership and management team and schedulers who listen and support the important work you do!\n\nQualifications\nIf you have these experiences, skills and qualifications, you are likely a good match for our team:\n\nCurrently registered and in good standing with the College of Nurses of Ontario (CNO)\nValid Ontario driver's license and reliable vehicle\nMandatory Covid 19 Vaccine Policy\nMust be able to an updated Vulnerable Screening Check\nTB and Hep B\nAble to work assigned line including alternate weekends and help with holiday coverage when needed\nProven planning, time management, organization and coordination skills\nDisciplinary free record\n\nIn accordance with the Accessibility for Ontarians with Disabilities Act 2005, upon request, support will be provided for accommodations throughout the recruitment, selection and assessment process.\nJob Types: Part-time, Permanent, Casual\nSalary: $29.21-$32.25 per hour\nSchedule:\n\n10 hour shift\n8 hour shift\n\nApplication question(s):\n\nDo you have access to a car or a reliable form of transportation?\nAre you legally entitled to work in Canada?\n\nEducation:\n\nBachelor's Degree (preferred)\n\nLicence/Certification:\n\nRegistered Practical Nurse (RPN) License (required)\n\nWork Location: In person"
    },
    {
        "job_title": "store associate , , Guelph, (7am availability)",
        "job_location": "Guelph, ON",
        "job_salary": "Part-time",
        "job_description": "\n\nSolita discovered ADVENTURE working at TJX.\n Every day at our stores feels like a new adventure to Solita and she says that’s what makes her work so exciting. The challenges, problem-solving and constant variety are just some of the things that you’ll discover working with us too!\n\n What you’ll discover\n Eligible Associates can look forward to:\n\n One-of-a-kind, inclusive culture\n Dedicated training and on-the-job resources to enhance your development \nMerchandise discount for yourself and eligible family members at all TJX Canada stores\n Associate and Family Assistance Program to support healthy living\n\n\n What you’ll do \nIt’s safe to say, there’s no shortage of variety in what we do. Here are some key responsibilities of the role:\n\n Greeting customers in a friendly manner; be knowledgeable to answer questions regarding merchandise items, prices and brands and provide information on promotions, TJX Canada policies and procedures, events and store locations\n Processing of daily shipments, organization and set-up of the warehouse area; ensuring all merchandise is received, processed and merchandise presentation standards are maintained\n Demonstrating a high degree of customer service while processing all refunds, exchanges and purchases in accordance with company guidelines\n Assisting with Fitting Room duties including ensuring counter area is clean, organized and has the proper supplies in place and assisting customer inquiries\n For a closer look into the role, click HERE\n\n\n What you’ll need\n To begin your career with us, you’ll have:\n\n High school education or equivalent work experience\n Excellent customer service, communication (verbal and written) and time management skills\n The ability to set up and maintain a warehouse environment\n\n .\n\n Every day is an opportunity to discover something new about our business, our partnerships and even something exciting about yourself. By becoming a member of our TJX Canada family, you’ll have the full support of a diverse, close-knit group of people across our Distributions Centres, Retail Stores (Winners, HomeSense, Marshalls) and our Office locations. Are you ready to Discover Different?\n\n Here at TJX Canada, we are an equal opportunity employer committed to the inclusion and accommodation of all individuals.\n"
    },
    {
        "job_title": "Registered Massage Therapist - Waterloo Uptown",
        "job_location": "104 King Street South, Waterloo, ON",
        "job_salary": "Temporary",
        "job_description": "Our clinic provides full-service administrative support, which means taking care of the bookings, billing, marketing, laundry and supplies, so that you can focus 100% on your clients.\nHere is what we offer:\n\nSigning Bonus Available - up to $7,000\nHealth-Care benefits package; starts immediately and no medical required\nWe pay your annual CMTO registration fee!\nImmediate client base waiting for you. Your schedule will be full your first week!\nWage/Schedule Guarantees - up to 95%\nCompetitive compensation package\nFlexible schedules to meet your work-life balance\nAccess to an online booking system – monitor your schedule from your phone anywhere\nAdditional online training through DexterityPD.com for your CEU requirements or for those passionate about education\n\nWhether you are ready to make a change or simply considering your options - I would definitely like to connect. It never hurts to have another professional connection in the area.\nCoffee is on me!\nJob Types: Full-time, Part-time, Fixed term contract, Casual, Seasonal\nBenefits:\n\nDental care\nExtended health care\nFlexible schedule\nLife insurance\nOn-site parking\nStore discount\nTuition reimbursement\n\nSchedule:\n\n4 hour shift\nDay shift\nEvening shift\nMonday to Friday\nMorning shift\nNo weekends\n\nSupplemental pay types:\n\nRetention bonus\nSigning bonus\nTips\n\nLicence/Certification:\n\nMassage Therapist Certification (required)\n\nWork Location: In person"
    },
    {
        "job_title": "Registered Dental Hygienist",
        "job_location": "Cambridge, ON",
        "job_salary": "Up to $60 an hour",
        "job_description": "About the Role\nThank you for considering applying for our Dental Hygienist role. We're excited to be hiring for both full-time and part-time positions for new clinic in Cambridge, opening in April 2024. Our Dental Hygienists are incredibly important to the success of our practice, team dynamic and patient experience. Our Dental Hygienists start at $60 an hour, and with our unique bonus incentive system, your income potential with us is almost limitless.\nWe offer flexible hours, with evening (3-9pm), morning (8am) and weekend shifts available.\nExperience and Skills Required\n● New grads welcome\n● Registered and/or licensed by the dental hygiene regulatory authority within the province; good standing.\n● Experience with Dental practice management software (such as Dentrix/Abeldent/Cleardent) is not required, but considered an asset\n● Evening and weekend availability.\n● Strong organizational and multitasking skills.\n● Excellent interpersonal skills: demonstrated ability to adapt and respond to a variety of patients.\n● Friendly and calm demeanour.\n● Thrive working in fast-paced environments.\n● Valid CPR certification.\n● IPAC certification is not required but considered an asset.\n● WHIMS certification is not required but considered an asset.\nIf you think you would be an asset to our team and want to join a fast growing healthcare company, please apply today and submit your resume!\nJob Types: Full-time, Part-time\nSalary: Up to $60.00 per hour\nBenefits:\n\nDental care\n\nSchedule:\n\nDay shift\nEvening shift\nMonday to Friday\nMorning shift\nWeekends as needed\n\nWork Location: In person"
    },
    {
        "job_title": "Bakery Clerk/Doughnut Decorator",
        "job_location": "46 Quebec Street, Guelph, ON",
        "job_salary": "$16.55–$18.50 an hour",
        "job_description": "**THIS IS FOR THE GUELPH LOCATION**\nAre you ready to step into the sugary wonderland of doughnuts, where happiness is served on a tray and sprinkles are our currency? If you've got a big appetite for fun, a passion for providing top-notch customer service, and a love for all things doughnut-shaped, then we have the perfect job offer for you!\nJob Title: Doughnut Maestro (Clerk and Decorator)\nResponsibilities:\n\nDoughnut Artistry: Transform ordinary doughnuts into edible works of art that will make mouths drop and eyes widen. Whether it's a vibrant rainbow design, an intricate floral pattern, or a whimsical character, you'll be the creative genius behind our doughnut masterpieces.\nSugar Symphony: Skillfully handle an array of frosting, glazes, sprinkles, and toppings to compose symphonies of taste and texture. Your palette will consist of an assortment of flavors, colors, and textures, enabling you to craft delectable doughnuts that will ignite joy with every bite.\nCollaborative Confectionery: Work closely with our talented team of pastry chefs and bakers to ensure a seamless integration of flavors and aesthetics. Together, you'll create a symphony of taste and beauty that will tantalize taste buds and please the eye.\nSmile Ambassador: As the face of our doughnut shop, your mission will be to greet customers with a smile as warm and inviting as a freshly baked doughnut. You'll take their orders, answer their questions, and sprinkle their day with kindness and enthusiasm.\nDoughnut Matchmaker: You'll help customers navigate our doughnut wonderland, guiding them through an array of delectable choices. From glazed rings to jelly-filled delights, you'll assist in finding the perfect doughnut match for each and every sweet seeker.\nDoughnut Storyteller: Share the fascinating tales behind our doughnuts. From the origins of the classic glazed to the secret recipe for our signature flavors, you'll regale customers with delightful stories that will leave them craving for more.\n\nQualifications:\n\nDoughnut Devotee: You must have an unwavering love for doughnuts, from the traditional classics to the wild and wacky creations. A discerning palate for distinguishing a good doughnut from an exceptional one is highly desirable.\nSupercharged Energy: You'll be the doughnut superhero behind the counter, so we need someone with a zest for life that matches the sugar rush of our treats. Energy, enthusiasm, and a spring in your step are essential ingredients for this role.\nSprinkle of Charm: A friendly and outgoing personality will be your secret weapon for creating a memorable experience for our customers. Your ability to engage with people, spark conversations, and make them feel at home will set you apart.\n\nJob Types: Full-time, Part-time, Permanent\nSalary: $16.55-$18.50 per hour\nExpected hours: 12 – 35 per week\nBenefits:\n\nCasual dress\nDental care\nDisability insurance\nDiscounted or free food\nExtended health care\nFlexible schedule\nLife insurance\nOn-site parking\nStore discount\nVision care\n\nSchedule:\n\nDay shift\nEvening shift\nHolidays\nMorning shift\nWeekends as needed\n\nSupplemental pay types:\n\nTips\n\nExperience:\n\nBaking: 1 year (preferred)\n\nWork Location: In person"
    },
    {
        "job_title": "Dental Receptionist",
        "job_location": "Crystal Dental in Fergus, ON",
        "job_salary": "From $22 an hour",
        "job_description": "\n1 year of Canadian dental office experience will be preferred.\nStudents with dental degree on work permit are welcome to apply.\nBuilding and maintaining strong relationships with existing and new patients.\nEnsuring an overall positive patient experience.\nFollowing up with patients and scheduling appointments.\nSending out predeterminations to insurance and follow ups.\nPatiently listen and responding to patient’s feedback and comments.\nHandling insurances, billing, and payments (Cash/credit card etc.)\nReviewing financial options, payment plans with patients.\nManaging daily appointment schedules.\nAnswering phones and making follow up calls\nCatch up with recall list\nRegular monitoring of accounts receivables\nManage scheduling of patients efficiently\nAvailability on weekends.\n\nJob Types: Full-time, Part-time\nSalary: From $22.00 per hour\nBenefits:\n\nDental care\n\nFlexible Language Requirement:\n\nFrench not required\n\nSchedule:\n\n8 hour shift\nDay shift\nEvery Weekend\nMonday to Friday\nMorning shift\n\nAbility to commute/relocate:\n\nFergus, ON: reliably commute or plan to relocate before starting work (required)\n\nWork Location: In person"
    },
    {
        "job_title": "Host",
        "job_location": "105 Gordon Street, Guelph, ON",
        "job_salary": "From $16.55 an hour",
        "job_description": "Job Purpose:\nThe Restaurant Host is often the first team member to interact with guests as they enter the restaurant. In this important position, the Host is a personal representation of the service and overall hospitality of a Pearle Hospitality property. It is the job of the Host to warmly welcome guests and either seat them in the dining room or direct them to the event they are attending. If guests are required to wait to be seated or to move to the event space, it is the job of the Host to ensure they are made comfortable and kept informed.\nKey Accountabilities:\n· Deliver above and beyond guest experiences, highlighting genuine and thoughtful hospitality.\n· Prepare host area\n· Accept and perform additional tasks as required for optimal performance of the restaurant.\n· Actively represent and promote Pearle Hospitality’s core values within the workplace.\n· Act as an ambassador of Bardō Guelph and Pearle Hospitality.\n· Follow company policies and procedures as defined and outlined by Pearle Hospitality.\n· Follow all Health and Safety standards to ensure a safe work environment for all guests and team members.\n· Adhere to all cleanliness and sanitization practices.\n· Maintain professional appearance and act with integrity and honesty.\nWhat we would like you to bring to the position:\n· Previous Host experience considered an asset\n· Communication: Able to communicate with guests as well as restaurant staff accurately and effectively regarding timing/waits. Answer any guest questions regarding the menu, or seek out appropriate team members to assist.\n· Customer service: Remain warm and welcoming to guests, making sure to provide a positive experience for each and every guest.\n\nAdaptability: Ability to remain poised and professional in a fast-paced environment and positively interact with a variety of diverse guests and team members.\nAttention to detail: Make quick assessments on table availability and relay wait times to guests in polite manner.\n\nWhy join Pearle Hospitality team at Bardō Guelph:\n· Competitive wages\n· Discounts at all Pearle Hospitality restaurants, hotels and spas\n· Training and Development\n· Growth opportunities\n· Amazing team and company culture!\nPearle Hospitality and affiliated companies, including Bardō Guelph accommodate the needs of job applicants throughout its recruitment and selection processes in accordance with the Ontario Human Rights Code and the Accessibility for Ontarians with Disabilities Act. Accommodation needs must be provided in advance. To discuss your needs, please contact the individual noted in the posting.\nJob Type: Part-time\nSalary: From $16.55 per hour\nExpected hours: 12 – 30 per week\nBenefits:\n\nDiscounted or free food\nEmployee assistance program\nFlexible schedule\n\nFlexible Language Requirement:\n\nFrench not required\n\nSchedule:\n\nDay shift\nEvening shift\nWeekends as needed\n\nSupplemental pay types:\n\nTips\n\nAbility to commute/relocate:\n\nGuelph, ON N1H 4H7: reliably commute or plan to relocate before starting work (required)\n\nApplication question(s):\n\nAre you presently or have you ever been employed by any affiliated Pearle Hospitality properties? If YES, List location\n\n(ETT: Bread Bars, The Pearle Hotel & Spa, Cambridge Mill, Elora Mill Hotel & Spa, Ancaster Mill, Spencer's At The Waterfront, Whistle Bear Golf Club)\nExperience:\n\nRestaurant: 1 year (preferred)\n\nWork Location: In person"
    },
    {
        "job_title": "cashier",
        "job_location": "Guelph, ON",
        "job_salary": "$16.55–$17.00 an hour",
        "job_description": "\n\nEducation: No degree, certificate or diploma\nExperience: 1 year to less than 2 years\nWork setting\n Discount house\n Tasks\n Operate cash register\n Provide advice about merchandise\n Assist in display of merchandise\n Type of product\n Paint and wallpaper\n Food and food products\n Cosmetics and toiletries\n Home electronics\n Security and safety\n Bondable\nWork Term: Permanent\nWork Language: English\nHours: 10 to 30 hours per week\n\n"
    },
    {
        "job_title": "citizen services officer (CSO) - government services",
        "job_location": "Cambridge, ON",
        "job_salary": "$30.88 an hour",
        "job_description": "\n\nEducation: Secondary (high) school graduation certificate\nExperience: 2 years to less than 3 years\nWork setting\n Urban area\n Computer and technology knowledge\n MS Excel\n MS Outlook\n MS Word\n MS Windows\n Security and safety\n Criminal record check\n Credit check\n Enhanced reliability security clearance\n Work conditions and physical capabilities\n Fast-paced environment\n Work under pressure\n Tight deadlines\n Attention to detail\n Large caseload\n Overtime required\n Personal suitability\n Accurate\n Client focus\n Efficient interpersonal skills\n Excellent oral communication\n Excellent written communication\n Flexibility\n Judgement\n Organized\nWork Term: Casual\nWork Language: Bilingual\nHours: 37.5 hours per week\n\n"
    },
    {
        "job_title": "Office Cleaner (part-time)",
        "job_location": "Guelph, ON",
        "job_salary": "From $18.50 an hour",
        "job_description": "Police background, and vulnerable sector check required.\nDetails: Cleaning of two separate office locations.\nSCHEDULE:\nTuesday: 7:00pm-9:00pm\nThursday: 7:00pm-10:00pm\nFriday: 6:00pm-8:30pm\nSunday: 2:00pm-5:00pm\nResponsibilities:- Perform general office cleaning duties, including dusting, sweeping, mopping, vacuuming, and trash removal- Clean and sanitize restrooms and break areas- Maintain cleanliness of common areas, such as hallways and entrances- Ensure all cleaning supplies are stocked and readily available- Follow established cleaning procedures and safety guidelines- Notify management of any maintenance or repair needs\nQualifications:- Previous experience in facilities maintenance or commercial cleaning is mandatory- Ability to work independently and efficiently- Strong attention to detail and thoroughness in completing tasks- Good time management skills to prioritize and complete assigned duties- Ability to follow instructions and work well within a team- Physical stamina to perform repetitive tasks and lift heavy objects if required\nPlease note that this job description is not exhaustive and additional duties may be assigned as needed.\nJob Type: Part-time\nSalary: From $18.50 per hour\nExpected hours: 10 – 12 per week\nSchedule:\n\nEvening shift\n\nExperience:\n\nCleaning: 1 year (required)\n\nLanguage:\n\nEnglish (preferred)\n\nLicence/Certification:\n\nDriving Licence (preferred)\n\nWork Location: In person\nExpected start date: 2024-03-21"
    },
    {
        "job_title": "Respiratory Therapist - Neonatal Intensive Care (Work in Hamilton)",
        "job_location": "Waterloo, ON",
        "job_salary": "$33.75–$46.62 an hour",
        "job_description": "Unit Summary\nStep into a job that opens countless doors. As Ontario’s most comprehensive healthcare system, and the only one in the province to provide care from pre-birth to end of life, we offer endless opportunities. You can explore advancement opportunities, take professional development courses, and stretch yourself as a leader, all at HHS.\nWe are the largest employer in the greater Hamilton region, and play a vital role in training the next generation of health professionals in collaboration with our academic partners, including McMaster University and Mohawk College. We are a world-renowned hospital for healthcare research, ranked fourth in Canada and we focus on improving the quality of care for our patients through innovation and evidence-based practices. Our multi-site hospital has over 1,100 beds and we offer world-leading expertise in many areas, including cardiac and stroke care, cancer care, palliative care and pediatrics. Open the door to a career that evolves with you. Start exploring opportunities now and join our team of over 15,000 dedicated staff, physicians, researchers and volunteers.\nMcMaster Children’s Hospital (MCH) has been providing care to children from across the region since 1988. Here, patients ranging in age from infancy to 17 benefit from a family-centred approach that prioritizes the child’s emotional, mental and physical well-being. The hospital is home to the fastest-growing kids-only emergency department in Ontario, one of Canada’s most advanced neonatal intensive care units, and a range of programs and clinics with unique expertise in a number of areas including children’s cancer, digestive diseases, and mental health.\nPosition Summary\nThe Neonatal Intensive Care Unit (NICU) at McMaster Children’s Hospital is comprised of a Level III NICU, a Level IIc nursery and a neonatal transport team, providing medical and surgical care to neonatal patients and their families. Our NICU serves a broad geographic area within southern Ontario. The interdisciplinary team provides family-centered care with a strong focus on evidence-based best practice and continuous quality improvement. McMaster NICU is also actively involved in a number of collaborative quality improvement initiatives provincially, nationally and internationally.\nOur NICU Registered Respiratory Therapists (RRTs) are assigned to the special care areas and are responsible for respiratory care in these areas. RRTs also provide education to nurses, other healthcare professionals and students throughout the unit. Other duties may be assigned, including but not limited to, such tasks as patient safety and quality improvement initiatives, committee work, and assisting in research.\nSchedule Work Hours\nRotating days, nights, weekends and holidays.\nQualifications\n\nGraduate of an accredited program in Respiratory Therapy\nCurrent Registration with the College of Respiratory Therapists of Ontario\nSuccessful Completion of the Canadian Board of Respiratory Care (CBRC) exam\nDemonstrated interpersonal, communication and teamwork skills\nCertified in Neonatal Resuscitation Provider (NRP)\nDemonstrated knowledge of ventilator requirements for the micro premature population\nDemonstrate the philosophy of Family Centered Care\nDemonstrate knowledge of developmental care\nWillingness to Precept respiratory therapy clinical students\nDemonstrated commitment to lifelong learning\nExperience, within the last 2 years, in a level 3 NICU is preferred\nExperience, within the last 2 years, attending high risk deliveries is preferred\n\nAs a condition of employment, you are required to submit proof of full COVID-19 vaccination to Employee Health Services.\nHamilton Health Sciences fosters a culture of patient and staff safety, whereby all employees are guided by our Mission, Vision, Values, and Values Based Code of Conduct. Hamilton Health Sciences is a teaching hospital and all staff and physicians are expected to support students and other learners.\nTo be considered for this opportunity applicants must apply during the posting period. All internal and external applicants may ONLY apply via the Careers website.\nHamilton Health Sciences is an equal opportunity employer and we will accommodate any needs under the Canadian Charter of Rights and Freedom, Accessibility for Ontarians with Disabilities Act and the Ontario Human Rights Code. Hiring processes will be modified to remove barriers to accommodate those with disabilities, if requested. Should any applicant require accommodation through the application processes, please contact HR Operations at 905-521-2100, Ext. 46947 for assistance. If the applicant requires a specific accommodation because of a disability during an interview, the applicant will need to advise the hiring manager when scheduling the interview and the appropriate accommodations can be made.\nThis competition is open to all qualified applicants, however, qualified internal applicants will be considered first. Past performance will be considered as part of the selection process. If you are a previous employee of Hamilton Health Sciences, please note: the circumstances around an employee's exit will be considered prior to an offer of employment\nProficiency in both Official Languages, French and English, is considered an asset\nIf this position is temporary, selection for this position will be as per the outlined Collective Agreements:\nArticle 30 (k), CUPE Collective Agreement\nArticle 10.7 (d), ONA Collective Agreement\nArticle 13.01 (b) (ii), OPSEU 273 Collective Agreement\nArticle 14.04, OPSEU 209 Collective Agreement\nArticle 2.07 and Article 13, PIPSC RT Collective Agreement\nJob Type: Part-time\nSalary: $33.75-$46.62 per hour\nBenefits:\n\nDental care\nEmployee assistance program\nExtended health care\nOn-site parking\nPaid time off\nVision care\n\nWork Location: In person"
    },
    {
        "job_title": "Nurse Practitioner",
        "job_location": "Canada",
        "job_salary": "Part-time",
        "job_description": "Horizon is the largest regional health authority – and one of the largest employers – in New Brunswick. With 12 hospitals and more than 100 medical facilities, we focus on delivering quality and safe health care services, ranging from acute and specialized care to community-based health services, to residents of New Brunswick, northern Nova Scotia and Prince Edward Island.\nHorizon is searching for health care leaders focused on improving patient experiences and outcomes, with opportunities to work in acute or primary care settings. In addition to a competitive salary, comprehensive benefits and excellent opportunities for professional growth, we currently offer the following recruitment incentives for Nurse Practitioners:\n· Up to $10,000 for hard-to recruit roles· Up to $5,000 in relocation assistance for eligible positions\nQualifications:· Masters of Nursing – Advanced Nursing Practice stream or equivalent nurse practitioner program· Current registration with the Nurses Association of New Brunswick (NANB) as a Nurse Practitioner or able to obtain upon hireNurse Practitioners are critical in Horizon’s ability to provide exceptional care. Duties include:· Diagnose, treat and manage acute or chronic illnesses· Order and interpret tests including X-rays, ECGs, etc.· Prescribe medications, treatments and therapies· Contribute to the overall well-being and quality of life of individual patients, as well as our communities in New Brunswick.\nNew Brunswick has something for everyone. It’s an outdoor enthusiast’s paradise and a desirable place to settle down and raise a family. Apply today and experience the east coast lifestyle and the chance to make a big difference in the lives of New Brunswickers.\nJob Types: Full-time, Part-time, Casual\nJob Types: Full-time, Part-time, Casual\nBenefits:\n\nCompany pension\n\nSchedule:\n\n12 hour shift\n\nWork Location: In person"
    },
    {
        "job_title": "Personal Support Worker (PSW) - Home Care Reimagined! $25-$28*",
        "job_location": "Guelph, ON",
        "job_salary": "$25–$28 an hour",
        "job_description": "Gotcare is a home care platform that empowers Canadians to select their care worker and determine the care schedule. We’ll take the work out of finding local care opportunities.\nBy registering with Gotcare we will alert you when a family has need of your services, typically within five minutes of where you live. As such local candidates are encouraged to apply for this position.\n\nPaid through agency $25 per hour\nPaid by family directly $25-28* per hour\n\n* Recommended range\nWHAT CARE WORKERS LIKE\n\nMake your own schedule\nLess travel\n\nWHAT PEOPLE ARE SAYING\n\n\" I have only been with Gotcare for about a month but it is so refreshing to be employed by a company who allows me to be me. I feel that they trust in my ability to do my job to the best standards and my clients feel freedom to make their own times and choices.\"\n\"Having been working in health care for many years you get to see a lot. Since I have been on board with Gotcare I am beyond impressed. The staff are always helpful, supportive and professional. Wonderful company and proud to be a part of their team. :)\nMore reviews: https://ca.indeed.com/cmp/Gotcare/reviews\n\nSKILLS REQUIRED\nCandidates may be required to complete the following tasks:\n\nFeeding, dressing, bathing, transferring, incontinence care, medication reminders, meal preparation, providing transportation, light housekeeping, companionship\n\nWHAT OTHER COMPANIES CALL THIS ROLE\n\nPersonal Support Worker - PSW; Health Care Aide - HCA; Developmental Support Worker - DSW; Community Support Worker - CSW; Nursing Assistant - NA; Registered Nurse - RN; Caregiver (Informal)\n\nABOUT US\n\ngotcare.ca/care-worker/\n\nWork Remotely\n\nNo\n\n#ONcare\nJob Types: Part-time, Full-time\nSalary: $25.00-$28.00 per hour\nBenefits:\n\nFlexible schedule\n\nExperience:\n\ncare: 1 year (preferred)\n\nLicence/Certification:\n\nPSW Certificate or equivalent (preferred)\n\nWork Location: On the road"
    },
    {
        "job_title": "Evening Janitorial /Cleaner",
        "job_location": "Bear Group Property Service Ltd. in Guelph, ON",
        "job_salary": "$16.55–$18.00 an hour",
        "job_description": "```Job Overview:```We are seeking a reliable and detail-oriented Janitor to join our team. As a Janitor, you will be responsible for maintaining cleanliness and orderliness in our facilities. This is a crucial role in ensuring a safe and pleasant environment for our employees and visitors.\n```Duties:```- Perform general cleaning tasks such as sweeping, mopping, dusting, and vacuuming- Clean and sanitize restrooms, break rooms, and other common areas- Empty trash receptacles and dispose of waste properly- Restock supplies in restrooms and other designated areas- Maintain cleanliness of windows, glass surfaces, and mirrors- Follow cleaning schedules and ensure all tasks are completed in a timely manner- Report any maintenance or repair needs to the appropriate personnel- Adhere to safety guidelines and protocols while performing duties\n```Experience:```- Previous experience in facilities maintenance or commercial cleaning is preferred- Knowledge of cleaning techniques and equipment is a plus- Ability to work independently with minimal supervision- Strong attention to detail and organizational skills- Physical stamina to perform tasks that require standing, bending, lifting, and carrying heavy objects\nIf you are a dedicated individual with a passion for cleanliness and maintaining a safe environment, we encourage you to apply for this position. Join our team as a Janitor and contribute to creating a clean and welcoming atmosphere for all.\nPlease note that only qualified candidates will be contacted for further consideration.\nJob Type: Part-time\nSalary: $16.55-$18.00 per hour\nExpected hours: 25 – 30 per week\nBenefits:\n\nOn-site parking\n\nFlexible Language Requirement:\n\nFrench not required\n\nSchedule:\n\nEvening shift\nMonday to Friday\n\nExperience:\n\nCleaning: 1 year (preferred)\n\nLanguage:\n\nEnglish (required)\n\nLicence/Certification:\n\nDriving Licence (preferred)\n\nLocation:\n\nGuelph, ON N1G 4T7 (preferred)\n\nWork Location: In person\nApplication deadline: 2024-03-25Expected start date: 2024-04-01"
    },
    {
        "job_title": "Delivery Driver / Courier Fergus - Elora",
        "job_location": "Fergus, ON",
        "job_salary": "Part-time",
        "job_description": "Delivery Driver Part TimeBecoming a courier on the Skip Network gives you the freedom to be your own boss and deliver when you want. Sign up today and start earning cash.\n\nGet paid when you want\nPick your own availability\nDeliver as little or as much as you like\nFlexible hours\nNo experience required\nKeep 100% of your tips\n\nGet on the road now, apply today!Why should you courier on the Skip Network?Besides being your own boss, there are many good reasons. You get to deliver to communities you’re familiar with, which means less driving, more orders, and of course, more money in your pocket. To ensure you get paid fast, you can cash-out your delivery earnings at any time by using the Fast Cash feature in the Courier App.1. Flexibility that suits you!Your schedule revolves around you. If you want to deliver in the morning, go for it. Whatever suits your lifestyle, and you can adjust your availability any time.2. Potential to earn.As a courier, you can control how much you make on the Skip Network. Pick up open gigs, complete more deliveries and update your availability. The more you deliver, the more you earn.What do you need to be a courier?To be eligible to deliver on the Skip Network, you will need to be of the age of majority in your province of residence and have the following:\n\nA smartphone with a data plan\nA valid driver’s licence\nBackground check\nThermal bag\n\nWhat else is needed to be a courier on the Skip Network?You must provide documentation that indicates you can legally work in Canada.You may provide one of the following:\n\nWork permit\nStudy permit\nPermanent Residence card\nCanadian passport\nCanadian birth certificate\nCanadian citizenship certificate\nCanadian citizenship card\n\nYour information is kept confidential in accordance with our Privacy Policy.How to sign up:1. You’ll have to:* Create an account* Upload documents* Complete a quick background check\n2. Once you’re done...* Upload your background check* Download the Courier App* Set your availability* Pick up any open shifts* Start making deliveries to earn some fast cash\nWho are we?Skip is a Canadian technology company that facilitates online ordering and food delivery in 100+ North American cities. Through the Skip Network, restaurants gain more business, earn extra money, and customers save time by ordering from thousands of local restaurants.\nJob Type: Part-time\nWork Location: In person"
    },
    {
        "job_title": "Part Time School Bus Driver",
        "job_location": "Acton, ON",
        "job_salary": "$21.45 an hour",
        "job_description": "No Experience? Love to Drive? Enjoy Working with Children? Need a Flexible Part-Time Schedule?\nIf you answered Yes, to any of these questions, then Student Transportation of Canada might be the right place for you!\nElliott Coach Lines, a division of Student Transportation of Canada is looking for new and experienced School Bus Drivers. If you have a Class-B license, great! If you need help to get your Class-B, we will train you for FREE!!!!!\nWhat we Offer:\n\n$21.45/hour\nFree license upgrades\nMonday to Friday schedule\nHolidays and Summer off\nPart-Time, Flexible Employment (15-20 hours per week)\nMake a positive difference in the lives of local children\nBring your child on board, get paid and save on daycare!\n\nWhat do School Bus Drivers do???\nIt's pretty simple, in the morning we pick up school aged passengers from predetermined locations and then deliver them to school. In the afternoon, we do the exact same thing, just in reverse order; we take them from school back home (once again at predetermined locations).\nSchool Bus Drivers operate Monday - Friday, from September until the end of June...that's right, summers off. Depending upon your specific route, you could work anywhere from 7am -9:30am then again in the afternoon from about 2pm - 4pm.\nWho can do this job???\nAs long as you are responsible adult and have at least a 'Class-G' drivers license, we can teach you how...for FREE!!!\n\nLooking for extra income?\nRecently retired?\nUber/Lyft/Cab experience?\nor just curious...?\n\nContact us today to get started\nStudent Transportation of Canada is proud to be an equal opportunity employer. If you require a disability related accommodation to take part in our interview and selection process, or have any questions please reach out directly to a member of our Recruitment Team.\n#parttime #schoolbusdriver #driver #schoolbus\nJob Type: Part-time\nSalary: $21.45 per hour\nSchedule:\n\nDay shift\nMonday to Friday\nNo weekends\n\nWork Location: In person"
    },
    {
        "job_title": "Baker/Cashier",
        "job_location": "The Great Canadian Bagel - Guelph in Guelph, ON",
        "job_salary": "From $16.55 an hour",
        "job_description": "Bake bagels and making bagels doughs according to the requirements by manager\nJob Type: Part-time\nSalary: From $16.55 per hour\nExpected hours: 10 – 25 per week\nBenefits:\n\nCasual dress\nDiscounted or free food\nFlexible schedule\n\nFlexible Language Requirement:\n\nFrench not required\n\nSchedule:\n\n4 hour shift\n8 hour shift\n\nSupplemental pay types:\n\nOvertime pay\n\nAbility to commute/relocate:\n\nGuelph, ON: reliably commute or plan to relocate before starting work (required)\n\nApplication question(s):\n\nCan you work early morning , starting 5:30 AM?\n\nExperience:\n\nBaking: 1 year (preferred)\n\nWork Location: In person\nExpected start date: 2024-03-18"
    },
    {
        "job_title": "Part-time College Service Representative (2 Vacancies)",
        "job_location": "Guelph, ON",
        "job_salary": "$27.89–$32.31 an hour",
        "job_description": "\nRequisition Details \n\n\n\n\n\n\n\n\nJob Title: Part-time College Service Representative (2 Vacancies) \nRequisition #: 24-0050 \nCampus: Doon \nDepartment: Client Services & Student Fees \nPayband: E \nStarting Rate: $27.89 \nPayband Range: $27.89 - $32.31 \nHours/Week: 24 \nPosting Date: Tuesday, March 19, 2024 \nClosing Date: Monday, April 1, 2024 at 11:59 PM EST \nVacancy Type: Support Staff - Part-time Regular \n\n\n\n\n\n\n\n\n\nSupport Staff Regular Part-time New Position\n(First consideration for Support Staff and Academic positions will be given to internal applicants in accordance with the respective Collective Agreements)\nThe College Service Representative is an integral member of the Registrar’s Office team and is the first point of contact for the online chat system, AskMe and Customer Feedback email inboxes, for all members of the Conestoga College community. The College Service Representative will assist students/clients requesting service from the Registrar’s Office, including Student Fees, Students Records, Student Financial Services and Domestic Admissions. They will assist College wide departments, including the academic areas, Student Success, International Education and Human Resources, by evaluating each enquiry, providing resources and triaging the inquiries to the appropriate area.\nThe College Service Representative maintains a working knowledge of all campus resources and services to effectively refer to these services quickly and in real time. They are also responsible for updating the College wide directory, providing up to date contact information, in collaboration with Human Resources, maintaining the highest confidentiality regarding college staffing and departmental changes. They serve the College community adhering to all relevant College and Ministry procedures, including Freedom of Information and Protection of Privacy Act (FIPPA).\nSuccessful candidates will be required to conduct work within Ontario and must be available to work on campus as required. It is anticipated that this position will meet the needs of the department through a hybrid work arrangement, working remotely, with on-site days scheduled in advance.\nResponsibilities:\n\nRespond to all inquiries received through email, and electronic chat systems regarding college programs, courses, events and a broad range of questions, and information related to a number of college services\nAssist clients and students in locating information on the college website and navigating the student portal such as: Ancillary services information, IT Information, and residence/housing information\nProvide general information on various different college services and provide website and portal wayfinding to students/clients\nAssist clients in navigating the international education services, guidelines, and admission cycles\nDevelop a working knowledge of the Registrar’s Office and International Education academic cycles and information such as: application processes, fees and return policies, credit transfer processes, Ontario Student Assistance Program (OSAP), and the program withdrawal/refund process\nRefer clients to the correct services through guided discussion and assessment\nReview of emails located in the “AskMe\" and “Customer Feedback” folders which includes responding to or transferring the email to the appropriate department\nSupport IT in resetting passwords for access to the student portal\nSupport and maintain the College wide directory, ensuring its accuracy by updating the public facing version through the administrative portal – this includes liaising with department heads, IT Solutions, Design and Delivery, as well Human Resources\nPerforms other duties as assigned\n\n\n\nQualifications:\n\nTwo-year Diploma in Communications, Marketing, Business, Office Administration or a related field is required\nTwo years of related practical experience in the field of customer service, marketing, public relations, sales or call centre, including the use of email and online communications and other tools; preferably in a post-secondary setting\nAbility to work well in a team environment, as well as independently\nIntercultural communications Skills\nSuperior interpersonal and team skills and the ability to communicate professionally, tactfully, and diplomatically\nStrong ability to build rapport with international students\nGood organizational and time management skills\nDemonstrated ability to work under pressure and in demanding situations\nAbility to multitask\nExcellent conflict management and problem solving skills\n\n#LI-POST\n\n"
    },
    {
        "job_title": "Personal Support Worker (PSW) - Part Time",
        "job_location": "42 Elliott Street, Cambridge, ON",
        "job_salary": "$21.97 an hour",
        "job_description": "We are currently recruiting for experienced Personal Support Workers to join our rapidly growing team. \n\n Do you have a passion or interest in working with seniors? JOIN AN AWARD-WINNING TEAM! \n\n peopleCare Communities is thrilled to be named one of Canada’s Best Managed Companies for the tenth year in a row. This award recognizes top companies across Canada for overall performance, sustained growth, strategy, capabilities and innovation, culture and commitment, and leadership. We are also accredited with Exemplary Standing, the highest award possible through Accreditation Canada’s Qmentum program. \n\n THE ROLE \nAs a member of the nursing team, this position works under the direction of the Registered Nurse / Registered Practical Nurse while providing personal care to residents in assigned areas in accordance with individual resident care plans. The position complies with all legislative standards, company policies/procedures and rules/regulations in a professional manner. \nReports to: Registered Nurse/Registered Practical Nurse \n\n RESPONSIBILITIES \n\n\nUnder the direction of the registered nursing staff, provides personal care to promote the comfort and safety of residents. Some typical activities include bathing, skin care, toileting, mouth care, dressing/undressing, grooming, shaving, nail and hair care. Provides physical assistance to residents as required.\nUnder direction, performs selected procedures such as administering enemas and suppositories, collecting specimens and recording vital signs. Reports all findings to registered staff.\nAssists in the maintenance of a clean, safe environment. Some typical activities include making beds, cleaning bedside units, collecting/bagging soiled linen for dispatch to laundry, sorting and storing clean linen, emptying bedpans and removal of unsafe objects etc.\nConsults with and informs supervisor of unit activities, needs and problems related to resident care.\nAssists in providing restorative care for residents, assists with ambulation, nutritional needs and palliative care.\nEncourages participation in life enrichment programs by preparing residents for and assisting them to and from activities.\nAssists with admission, discharge and transfer of residents.\nAssists with meal service to residents and provides feeding assistance as required.\nProvides emotional/social support for residents.\nResponsible for resident safety - according to role.\nAssists in the maintenance and proper care of nursing equipment.\nParticipates in resident care conferences and committees as required.\nDocuments resident care activities in accordance with the home’s policy using software such as PCC.\nAdheres to established department policies and procedures regarding quality assurance, safety, environment and infection control.\nDisplays an attitude that is focused on working safely and ensuring that the work environment is safe and healthy.\nUses safe work practices.\nReports any actual or potential hazard to the immediate supervisor.\nUses or wears personal protective equipment (or clothing) as required.\nPromptly reports personal injury to supervisor and seeks first aid as needed.\nParticipates in fire safety activities and knows the facility fire and disaster plan.\nMaintains a clean and orderly work area.\nDoes not use or operate any equipment in a way that would endanger any worker, resident or visitor.\n EDUCATION AND EXPERIENCE \n\n\nEvery new employee hired by peopleCare to work as a PSW must have successfully completed a Personal Support Worker program that meets requirements of Long Term Care Health Act: Reg. 47 or meet the criteria in 47(3).\nHigh School Diploma (or equivalent)\nExperience in Long-Term Care considered an asset\nFirst Aid certification\nMust possess strong written and oral communication skills\nDemonstrated organizational and time management skills\nStrong interpersonal and customer focus skills\nMust have demonstrated sound skills and knowledge of providing personal care duties\nAbility to perform tasks that are necessary for the position, e.g. lifting/transferring clients\n Thanks for your interest in working with us!"
    },
    {
        "job_title": "Dental Assistant (Orthodontics)",
        "job_location": "120 McQueen Blvd, Fergus, ON",
        "job_salary": "Temporary",
        "job_description": "Our busy and friendly orthodontic practice is seeking a dental assistant to work on Wednesdays and/or Thursdays to fill you out for an assistant on a sick leave. This can potentially lead to a permanent position\nKey Responsibilities:\nAssist doctor and hygienist during orthodontic proceduresBring patients in for their visit, building a personal connection at every visit.Desire to help, educate and improve our patients’ lives.Sterilize dental instruments. Maintain and prepare equipment and supplies.Organize, clean, and maintain a clean and sterile clinical area.Maintain a positive attitude with fellow team members to provide an atmosphere of trust, respect, and cooperation.Perform any other tasks delegated or assigned.\nRequirements:Dental Assistant experience.Excellent interpersonal and communication skills; written and verbal, an ability to make patients feel comfortable and at ease.Great time management and organizational skills.Experience in an orthodontic office is a plus.\nJob Types: Part-time, Fixed term contract, Casual\nExpected hours: 16 – 18 per week\nFlexible Language Requirement:\n\nFrench not required\n\nSchedule:\n\n8 hour shift\nDay shift\n\nAbility to commute/relocate:\n\nFergus, ON N1M 3T8: reliably commute or plan to relocate before starting work (preferred)\n\nExperience:\n\nDental Assisting: 1 year (required)\n\nLanguage:\n\nFluent English (required)\n\nLicence/Certification:\n\nCertified Dental Assistant (preferred)\n\nWork Location: In person"
    },
    {
        "job_title": "Drivers wanted - Alternative to part-time, full-time and seasonal work",
        "job_location": "Cambridge, ON",
        "job_salary": "Part-time",
        "job_description": "\nNew drivers in Kitchener-Waterloo earn a CA$250 bonus for 25 rides in 30 days. Terms apply.\nDrive with Lyft and discover bonuses, pay transparency, and new roads to earning income.\n\nWhat is Lyft?\nLyft is a flexible earning opportunity and a platform that connects drivers with individuals that need rides. Driving with Lyft is the perfect way to earn money on any schedule and is a great alternative to part-time, full-time and seasonal opportunities. Drivers can cash out any time with Express Pay. Drivers enjoy flexibility with no hourly requirement. \nWhy Lyft?\n\nBoost Your Earnings: With Upfront Pay you can view the fare for a ride before you accept it, giving you more control of your earnings. Plus, you keep 100% of your tips. \nBe Your Own Boss: Set your own schedule and keep control over when you drive and earn\n\nDriver Requirements\n\nYou're at least 25 years old\nValid driver’s licence\nAny smartphone that can download and run the Lyft Driver app\nPass an annual driver screening, which reviews your driving history and criminal background check\nYou have a 4-door from 2014 or newer\n\nIn-Province license required for Ontario and Alberta. British Columbia driver’s license must be Class 1, 2, or 4.\n\n\nCar year may vary by region\n\n\nDoes not apply if you are renting a car through Express Drive program\n\n\n\nAdditional information\nYou might consider driving with Lyft to earn extra money, driving with Lyft is a great way to supplement your part time or full time income. No experience is needed, but you may be a great fit if you have experience in the transportation industry such as a delivery driver, professional driver, truck driver, taxi driver or cab driver.\n"
    },
    {
        "job_title": "Occupational Therapist",
        "job_location": "Guelph, ON",
        "job_salary": "Permanent",
        "job_description": "Registered Occupational Therapist-Hybrid position\nBe a part of changing someone’s story….\n\nCompetitive compensation, diverse caseloads\nFull-time, Part-time or Contractor positions available\n\nRehab First Inc. is currently seeking Registered Occupational Therapists to join our team. The successful candidate will provide services and have the willingness to travel while living in one of the following areas:\nKitchener/Waterloo area\nRehab First is one of Ontario`s largest multidisciplinary assessment and treatment organizations,numbering approximately 120 professional staff that are supported by the Psychologists and Physicians on our MEDNet® roster.\nQualifications: \n\nYou hold a Master’s Degree or equivalent in Occupational Therapy and are currently licensed with COTO\nHave up to two years of experience working in the field of OT and are excited to provide service in the community\nExperience with Ontario’s Statutory Accident Benefits Schedule (SABS) a plus\nHave a valid CPR certificate\nHold a Valid Driver’s Licence, auto insurance and have a reliable vehicle\nCompletion of a satisfactory Police Vulnerable Sector Check within the last six months\n\nKey Responsibilities:\n\nComplete general and specialized assessments such as those for physical and cognitive capacities, mobility, and attendant care needs\nDevelop treatment plans with the client\nProvide client treatment in the clinic, their community, their home or workplace\nWork with clients that have a variety of injury or illness which may include physical, cognitive and/or mental health conditions\nPreparing and submitting case notes and reports\nAbility to work collaboratively as a member of a multidisciplinary team\n\nBased on the total compensation package you chose, Rehab First will provide you with:\n\nCompetitive compensation & for those who qualify a benefits package\nFlexible Schedule and opportunity to work from home office (computer and supplies provided)\nExperienced, committed, and accessible management for ongoing support and mentorship\nAn administrative team ready to support you\n\nIf you are excited to be a part of the vision of the Rehab First team and our clients’ journey, please forward your resume and cover letter to Bonnie Kramer at recruitment@rehabfirst.ca.\nWe thank all applicants for their interest; however, only those candidates chosen for an interview will be contacted.\nJob Types: Full-time, Part-time, Permanent, Casual\nBenefits:\n\nFlexible schedule\n\nApplication question(s):\n\nDo you reside in Kitchener/Waterloo area?\n\nEducation:\n\nMaster's Degree (required)\n\nExperience:\n\noccupational therapy: 2 years (preferred)\n\nLicence/Certification:\n\nDriving Licence (required)\nAre you registered in COTO? (required)\n\nWork Location: On the road"
    },
    {
        "job_title": "Dog Bather/Receptionist",
        "job_location": "87 Macdonell Street, Guelph, ON",
        "job_salary": "$19–$21 an hour",
        "job_description": "We are seeking a Bather/Receptionist to join our team! You will be responsible for assisting the groomer complete grooming services, assisting customers with booking/paying for appointments, as well as maintaining the standard of service at our facility.\nLocation is now 226 Speedvale Ave W, unit 9\nResponsibilities:\n\nHandle general care tasks such as bathing and drying the animals to be groomed\nAssist in restraining animals if needed to help ensure a safe visit for humans and animals involved\nAssist groomer with any other basic grooming needs if asked\nKeep records of client visits as well as organize files\nAnswer phone calls & client questions\nMaintain a clean and healthy environment\nAssist customers with scheduling appointments\nCollect payment for services\n\nQualifications:\n\nMin 1 year experience in the pet grooming industry\nPassion to help animals\nAbility to interact with animals in a calm, non-threatening manner\nAbility to thrive in a fast-paced environment\nAbility to work independently as well as take instruction\nFriendly/Trustworthy/Reliable\nAbility to talk to customers in a professional and approachable manner\n\nJob Types: Full-time, Part-time\nSalary: $19.00-$21.00 per hour\nExpected hours: No less than 30 per week\nBenefits:\n\nCasual dress\nOn-site parking\n\nFlexible Language Requirement:\n\nFrench not required\n\nSchedule:\n\n8 hour shift\n\nSupplemental pay types:\n\nTips\n\nAbility to commute/relocate:\n\nGuelph, ON: reliably commute or plan to relocate before starting work (required)\n\nExperience:\n\ngrooming related: 1 year (required)\n\nLanguage:\n\nEnglish (required)\n\nWork Location: In person\nApplication deadline: 2024-03-25"
    },
    {
        "job_title": "Part Time Front of House Crew Member - Cashier/Customer Service",
        "job_location": "17 MacDonell St, Guelph, ON",
        "job_salary": "Permanent",
        "job_description": "Crafty Ramen is looking to add a Full Time Front of House Crew Member to our team in Guelph! If you have a great attitude, warm & welcoming personality and incredible work ethic, we are looking for you!\nResponsibilities:- Provide exceptional customer service to all patrons- Operate the point-of-sale (POS) system accurately and efficiently- Handle cash transactions and provide accurate change to customers- Maintain a clean and organized work area, including the cashier station and dining area- Assist with food preparation, dishwashing and kitchen duties as needed- Follow all food handling and safety guidelines- Answer customer inquiries and resolve any issues or complaints in a professional manner- Maintain knowledge of menu items, specials, and promotions- Collaborate with team members to ensure smooth operations\nQualifications:\n-SMART SERVE CERTIFICATION IS REQUIRED!- Previous experience in a customer service/restaurant or cashiering role is preferred- Strong time management skills to prioritize tasks effectively- Ability to handle cash transactions accurately and efficiently- Knowledge of basic math skills for calculating totals, discounts, and change- Familiarity with food handling and safety regulations is a plus- Excellent communication and interpersonal skills to interact with customers and team members- Ability to work in a fast-paced environment and handle multiple tasks simultaneously\nPlease note that this position may require standing for long periods of time and lifting up to 25 pounds.\nIf you are passionate about providing excellent customer service, have strong attention to detail, and enjoy working in a team-oriented environment, we would love to hear from you.\nJob Types: Part-time, Permanent\nExpected hours: 15 – 30 per week\nBenefits:\n\nStore discount\n\nFlexible Language Requirement:\n\nFrench not required\n\nSchedule:\n\n8 hour shift\nDay shift\nEvening shift\nHolidays\n\nSupplemental pay types:\n\nOvertime pay\nTips\n\nAbility to commute/relocate:\n\nGuelph, ON N1H 2Z4: reliably commute or plan to relocate before starting work (required)\n\nExperience:\n\nCustomer service: 1 year (preferred)\n\nLanguage:\n\nEnglish (required)\n\nLicence/Certification:\n\nSmart Serve (required)\n\nWork Location: In person"
    },
    {
        "job_title": "Part Time Front of House Crew Member - Cashier/Customer Service",
        "job_location": "17 MacDonell St, Guelph, ON",
        "job_salary": "Permanent",
        "job_description": "Crafty Ramen is looking to add a Full Time Front of House Crew Member to our team in Guelph! If you have a great attitude, warm & welcoming personality and incredible work ethic, we are looking for you!\nResponsibilities:- Provide exceptional customer service to all patrons- Operate the point-of-sale (POS) system accurately and efficiently- Handle cash transactions and provide accurate change to customers- Maintain a clean and organized work area, including the cashier station and dining area- Assist with food preparation, dishwashing and kitchen duties as needed- Follow all food handling and safety guidelines- Answer customer inquiries and resolve any issues or complaints in a professional manner- Maintain knowledge of menu items, specials, and promotions- Collaborate with team members to ensure smooth operations\nQualifications:\n-SMART SERVE CERTIFICATION IS REQUIRED!- Previous experience in a customer service/restaurant or cashiering role is preferred- Strong time management skills to prioritize tasks effectively- Ability to handle cash transactions accurately and efficiently- Knowledge of basic math skills for calculating totals, discounts, and change- Familiarity with food handling and safety regulations is a plus- Excellent communication and interpersonal skills to interact with customers and team members- Ability to work in a fast-paced environment and handle multiple tasks simultaneously\nPlease note that this position may require standing for long periods of time and lifting up to 25 pounds.\nIf you are passionate about providing excellent customer service, have strong attention to detail, and enjoy working in a team-oriented environment, we would love to hear from you.\nJob Types: Part-time, Permanent\nExpected hours: 15 – 30 per week\nBenefits:\n\nStore discount\n\nFlexible Language Requirement:\n\nFrench not required\n\nSchedule:\n\n8 hour shift\nDay shift\nEvening shift\nHolidays\n\nSupplemental pay types:\n\nOvertime pay\nTips\n\nAbility to commute/relocate:\n\nGuelph, ON N1H 2Z4: reliably commute or plan to relocate before starting work (required)\n\nExperience:\n\nCustomer service: 1 year (preferred)\n\nLanguage:\n\nEnglish (required)\n\nLicence/Certification:\n\nSmart Serve (required)\n\nWork Location: In person"
    },
    {
        "job_title": "Front of House Staff",
        "job_location": "370 Stone Road West, Guelph, ON",
        "job_salary": "From $16.55 an hour",
        "job_description": "About us\nThe Great Canadian Bagel - Guelph is a small business in Guelph, ON. We are customer-centric, fast-paced, and our goal is to make the best bagels in Guelph and around area..\nOur work environment includes:\n\nFlexible working hours\nSafe work environment\nFood provided\n\nPreparing bagels according to customers' orders.\nPreparing different kinds of food for sandwiches\nPreparing for opening and closing the store\nOther jobs assigned by manager\nJob Type: Part-time\nSalary: From $16.55 per hour\nExpected hours: 10 – 25 per week\nAbility to commute/relocate:\n\nGuelph, ON N1G 4V9: reliably commute or plan to relocate before starting work (required)\n\nWork Location: In person\nExpected start date: 2024-03-10"
    },
    {
        "job_title": "Medical Radiation Technologist X-Ray",
        "job_location": "Cambridge Medical Imaging in Cambridge, ON",
        "job_salary": "$32–$37 an hour",
        "job_description": "Job Description\nJob Summary\n\nWork primarily as a Radiation Technologist in General X-Ray.\n(Experience with Bone Mineral Density would be an asset.)\nPerform a variety of Radiographic procedures at a technical level.\nWork as a part of a team with a commitment to excellent patient care.\nPerform high quality Diagnostic Imaging with competence and care.\nComprehensive education and knowledge of anatomy and physiology,\nWorking knowledge of equipment and ability to troubleshoot problems.\nThe Registered Technologist is responsible to maintain competency and follow standards, as outlined by the College of Medical Radiation Technologists of Ontario (CMRTO).\n\nQualifications and Skills\n\nGraduate from an accredited Medical Radiation Program\nCurrent registration with the College of Medical Radiation Technologists of Ontario (CMRTO) required.\nMembership in the Ontario Association of Medical Radiation Sciences (OAMRS).\nInitiative, responsibility and organization required.\nGood verbal and written communication skills, as well as computer skills required.\nHave knowledge of all Radiographic exams, anatomy & physiology, physics and imaging equipment required.\nExperience and ability to image accurately, thoroughly and quickly required.\nExperience working with Radiographic equipment, PACS and computer software required.\nProvide records of continued education and learning.\nProblem-solving, time management and teamwork skills required.\nCommitment to excellence in patient care required.\nDemonstrated reliable attendance and ability/willingness to work various shifts required.\n\nJob Type: Part-time\nSalary: $32.00-$37.00 per hour\nFlexible Language Requirement:\n\nEnglish not required\n\nSchedule:\n\nMonday to Friday\nWeekends as needed\n\nExperience:\n\nX-Ray: 1 year (preferred)\n\nLicence/Certification:\n\nCMRTO (required)\nOAMRS (required)\n\nWork Location: In person"
    },
    {
        "job_title": "Casual Part Time Motor Coach Driver",
        "job_location": "370 Industrial Road, Cambridge, ON",
        "job_salary": "$29 an hour",
        "job_description": "Motorcoach Driver\nCambridge, ON\nThe Landline Company\nhttps://intelliapp.driverapponline.com/c/landlinecompanyca\nhttps://landlineco.com\nLandline is an innovative transportation company connecting customers to affordable air travel via our partner airlines. Our luxury motorcoaches allow customers to ride comfortably from regional airports to their nearest hub. We currently operate in the United States and are excited to continue our growth as we begin our Canada expansion in the Greater Toronto Area with our newest partner Air Canada!\nOur Values:\nCare for our communities. Be obsessive about the needs of our customers. Take care of each other and ourselves. Operate with kindness, integrity, and ingenuity.\nThe Role:\nWe are looking for full-time motorcoach drivers to join our team! This individual will have a varying schedule but will always know well in advance what their schedule will look like.\nIn addition to your driving responsibilities, you will assist with the loading/unloading of passenger baggage and cargo during the boarding and disembarkation process.\nDuties and Responsibilities:\nSafe, responsible, and timely operation of our passenger vehicles\nAccurate and timely completion of MTO and Company-required documentation, including electronic logs and vehicle inspections\nCourteous and thoughtful treatment of passengers and other drivers sharing the roadway\nProfessional conduct at all times while on duty or in uniform\nConduct pre-trip and post-trip vehicle inspections in a diligent and comprehensive manner with a special focus on safety.\nSafely load and unload baggage and cargo weighing up to 70 pounds/32 kg per unit and push/pull luggage carts with multiple items loaded\nFuel and clean vehicles\nBenefits:\nBasic and supplemental life and accident insurance for you and your family\nWeekly indemnity insurance\nLong-term disability insurance\nExtended health care coverage\nVision and dental care\nEmployee Assistance Program\nRegistered Retirement Savings Plan\nPaid time off\nFlight benefit privileges with our partner airlines\nRequirements:\nValid BZ or CZ driving licence and a minimum of 3 years of commercial driving experience operating motorcoaches or buses\nAbility to provide a driver’s abstract clear of any demerits\nCriminal reference check required\nApplicants must complete a pre-employment drug test to comply with company safety requirements\nAbility to meet the physical demands of the job, including the loading and unloading of luggage\nConfident and experienced in the use of tablets, smart phones, and online applications\nHigh School Diploma or equivalent education required\nExcellent customer service skills\nPositive attitude and strong work ethic\nWe are an equal opportunity employer committed to employing a diverse workforce. In compliance with federal and provincial human rights laws, qualified applicants are considered for all positions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, ethnic origin, age, marital status, family status, disability or any other protected group status.\nLandline thanks all candidates for their interest; however only those selected to continue in the process will be contacted.\nJob Type: Full-time\nDay range:\nHolidays\nMonday to Friday\nWeekend availability\nShift:\nUp to 10 hour shift\nDay shift\nEvening shift\nNight shift\nEducation:\nHigh school or equivalent (Required)\nExperience:\nCommercial driving: 3 years (Required)\nLicense/Certification:\nBZ or CZ (Required)\nShift availability:\nDay Shift (Preferred)\nNight Shift (Preferred)\nWork Location: In person\nJob Type: Full-time\nBenefits:\nPaid training\nExperience level:\n3 years\nSchedule:\nHolidays\nMonday to Friday\nWeekends as needed\nWeekends only\nWork Location: In person\nJob Type: Part-time\nPay: $29.00 per hour\nExpected hours: 1 – 20 per week\nApplication question(s):\n\nYou are applying to a Casual Part Time role\n\nExperience:\n\nProfessional Driving: 3 years (required)\n\nLicence/Certification:\n\nBZ or CZ licence (required)\n\nWork Location: In person"
    },
    {
        "job_title": "House Cleaner - Up to $25/hr, Great Pay, Flexible Schedule + Tips",
        "job_location": "Guelph, ON",
        "job_salary": "$20–$25 an hour",
        "job_description": "House Cleaners Wanted!\nInspireClean - Guelph and Kitchener-Waterloo\nAre you a skilled and motivated cleaner looking for a rewarding opportunity? Look no further! InspireClean, a leading house cleaning service in Southern Ontario, is seeking high-quality independent contractors to join our dedicated team.\nWhy InspireClean?\nCompetitive Compensation: Starting wage of $20 per hour during a 2-week probationary period, with an increase to $22 afterward. Further increments to $23 after 6 months and $24-$25 after a year. Additionally, enjoy tips, a rewards program, and a gas bonus.\nFlexible Hours: Create your availability online and enjoy the freedom of setting your own schedule. Work around your other commitments and achieve a healthy work-life balance.\nIncentives for Excellence: At InspireClean, we believe in recognizing and rewarding outstanding performance. Earn additional rewards through our rewards program and receive a gas bonus for going above and beyond.\nMeaningful Work: Make a difference in the lives of our clients by providing exceptional cleaning services. Your attention to detail and dedication will help create clean and inspiring spaces for our customers to enjoy.\nMust-Haves:\n\nFluent English\nValid police background check\nDriver's license and reliable vehicle\nSmartphone and internet connection\nCleaning supplies\n\nWhat We're Looking For:\n- Cleaning experience and a passion for delivering top-notch service\n- Excellent attention to detail and time management skills\n- Ability to work independently and follow our cleaning protocols\n- Strong communication skills and a professional demeanor\nJoin our team of dedicated professionals who take pride in their work and enjoy the support of a reputable and growing company.\nInspireClean offers a positive work environment, continuous feedback and support, and opportunities for personal and professional growth.\nTo apply, submit your application via Indeed or visit our website at https://inspireclean.ca/house-cleaning-jobs and complete the online application form.\nDon't miss out on this exciting opportunity to be part of InspireClean's success story!\nJob Types: Full-time, Part-time, Permanent\nSalary: $20.00-$25.00 per hour\nExpected hours: 10 – 40 per week\nBenefits:\n\nCasual dress\nOn-site parking\n\nFlexible Language Requirement:\n\nFrench not required\n\nSchedule:\n\nDay shift\nEvening shift\nMonday to Friday\nOn call\nWeekends as needed\n\nSupplemental pay types:\n\nBonus pay\nTips\n\nApplication question(s):\n\nWhy do you feel you would make a good fit with InspireClean?\nAre you able to travel to service locations in Guelph and Kitchener-Waterloo?\nAre you able to provide your own cleaning supplies and equipment as required for the job?\nDo you work well in both solo and team settings?\n\nExperience:\n\nResidential cleaning: 2 years (preferred)\n\nLanguage:\n\nfluent English (preferred)\n\nLicence/Certification:\n\npolice background check (or able to obtain) (preferred)\ndriver's license and reliable vehicle (required)\n\nWork Location: On the road"
    },
    {
        "job_title": "Dealer Trade Driver",
        "job_location": "Waterloo, ON",
        "job_salary": "$16.55 an hour",
        "job_description": "\nForbes GM is a proud member of the AutoIQ Dealership Network which is comprised of 11 physical dealerships throughout Central and Southern Ontario representing multiple brands. We are ambitious, innovative and forward-thinking and we strongly believe that our people are our greatest asset. As lifelong students of our craft, we pursue improvement at every turn. We do not settle for “Best” because our quest to improve and grow doesn’t have a finish line.\n We are currently seeking a Dealer Trade Driver to join our team of customer focused professionals within our high volume and process-driven dealership.\n Purpose/Summary of Position:\n This role is responsible for the safe driving of dealership vehicles to other dealerships in accordance with established processes and procedures. This role is also responsible for ongoing collaboration with fellow team members and improving efficiencies whenever possible\n Required Qualifications:\n\n\n Energized by challenges; driven to improve efficiencies, learn and grow\n Proactive self-starter with a desire for accountability\n Passion for delivering a consistently exceptional customer experience\n Operates with the highest level of integrity\n Exceptional initiative, high energy and positive attitude\n Process driven with impeccable organization and prioritization abilities\n Exceptional problem solving and conflict resolution skills\n Impeccable follow-through and commitment\n\n Candidates must possess:\n\n Valid driver’s license\n Minimum High School Diploma\n Must be able to physically able to handle the demands of the job and work outdoors in inclement weather conditions\n\n Why We’re Awesome:\n\n Operating partner infrastructure: We provide opportunities for advancement all the way up to ownership in the business\n Shared Core Values and Operating Principles across our dealership network\n Commitment to an exceptional employee experience\n Full benefit programs & competitive compensation plans\n Employee and Family Assistance Program\n Collaborative work environment & group support\n\n Qualified applicants are invited to apply with resume and cover letter.\n AutoIQ is an equal opportunity employer which values diversity in the workplace. If you require accommodation in order to participate in the hiring process, please contact us at 705-735-8895 or hr@autoiq.ca to make your needs known in advance.\n #IQETC\n"
    },
    {
        "job_title": "Drivers wanted - Alternative to part-time, full-time and seasonal work",
        "job_location": "Guelph, ON",
        "job_salary": "Part-time",
        "job_description": "\nNew drivers in Kitchener-Waterloo earn a CA$250 bonus for 25 rides in 30 days. Terms apply.\nDrive with Lyft and discover bonuses, pay transparency, and new roads to earning income.\n\nWhat is Lyft?\nLyft is a flexible earning opportunity and a platform that connects drivers with individuals that need rides. Driving with Lyft is the perfect way to earn money on any schedule and is a great alternative to part-time, full-time and seasonal opportunities. Drivers can cash out any time with Express Pay. Drivers enjoy flexibility with no hourly requirement. \nWhy Lyft?\n\nBoost Your Earnings: With Upfront Pay you can view the fare for a ride before you accept it, giving you more control of your earnings. Plus, you keep 100% of your tips. \nBe Your Own Boss: Set your own schedule and keep control over when you drive and earn\n\nDriver Requirements\n\nYou're at least 25 years old\nValid driver’s licence\nAny smartphone that can download and run the Lyft Driver app\nPass an annual driver screening, which reviews your driving history and criminal background check\nYou have a 4-door from 2014 or newer\n\nIn-Province license required for Ontario and Alberta. British Columbia driver’s license must be Class 1, 2, or 4.\n\n\nCar year may vary by region\n\n\nDoes not apply if you are renting a car through Express Drive program\n\n\n\nAdditional information\nYou might consider driving with Lyft to earn extra money, driving with Lyft is a great way to supplement your part time or full time income. No experience is needed, but you may be a great fit if you have experience in the transportation industry such as a delivery driver, professional driver, truck driver, taxi driver or cab driver.\n"
    },
    {
        "job_title": "Deliver Food with Uber - Flexible Gig",
        "job_location": "Guelph, ON",
        "job_salary": "Part-time",
        "job_description": "\nYour Schedule. Your Goals. Start Delivering with Uber.\n What is Uber?\n Delivering with Uber is an alternative to a part-time or full-time job and can get you earning cash quickly. Delivering with Uber allows you to earn quick cash while maintaining the flexibility your schedule requires (gig, part-time, full-time, seasonal, hourly, or temporary).\n Why Drive With Uber?:\n\n Receive your earnings fast: Your earnings are automatically transferred to your bank account every week.\n You are your own boss: You decide how much or little you want to drive and earn. \nGrab your car, bike, or by foot and deliver with Uber whenever you want—for an hour, a weekend, or throughout the week. \nSigning up only takes a few minutes: We'll provide support along the way and get you on the platform as soon as we can.\n Keep 100% of your tips.\n\n Requirements to Drive:\n\n Meet the minimum age to deliver in your city \nProof of work eligibility: Can be a Canadian Passport, Study or Work permit, Canadian Birth Certificate, Permanent Resident or Citizenship Card\n You consent to a background check\n You have an iPhone or Android smartphone\n If Car: Have a 2-door or 4-door car\n If Car: Have a valid driver’s licence in your name and proof of vehicle insurance\n\n Additional Information:\n If you have previous employment experience in transportation (such as a delivery driver, driver, professional driver, driving job, truck driver, heavy and tractor-trailer driver, cdl truck driver, class a or class b driver, local truck driver, company truck driver, taxi driver, taxi chauffeur, cab driver, cab chauffeur, taxi cab driver, transit bus driver, bus driver, coach bus driver, bus operator, shuttle driver, bus chauffeur) you might also consider delivering with Uber to earn extra money. We also welcome couriers who have worked with other peer-to-peer ridesharing or delivering networks. Couriers using the Uber platform come from all backgrounds and industries ranging from traditional driving and transportation industries to other industries. No professional delivering experience required. Delivering with Uber is a great way to supplement your part time or full time income.\n How to Sign Up\n 1) Click “Apply Now” and complete the sign up page.\n 2) Download the app and get started\n"
    },
    {
        "job_title": "Deliver Food with Uber - Flexible Gig",
        "job_location": "Guelph, ON",
        "job_salary": "Part-time",
        "job_description": "\nYour Schedule. Your Goals. Start Delivering with Uber.\n What is Uber?\n Delivering with Uber is an alternative to a part-time or full-time job and can get you earning cash quickly. Delivering with Uber allows you to earn quick cash while maintaining the flexibility your schedule requires (gig, part-time, full-time, seasonal, hourly, or temporary).\n Why Drive With Uber?:\n\n Receive your earnings fast: Your earnings are automatically transferred to your bank account every week.\n You are your own boss: You decide how much or little you want to drive and earn. \nGrab your car, bike, or by foot and deliver with Uber whenever you want—for an hour, a weekend, or throughout the week. \nSigning up only takes a few minutes: We'll provide support along the way and get you on the platform as soon as we can.\n Keep 100% of your tips.\n\n Requirements to Drive:\n\n Meet the minimum age to deliver in your city \nProof of work eligibility: Can be a Canadian Passport, Study or Work permit, Canadian Birth Certificate, Permanent Resident or Citizenship Card\n You consent to a background check\n You have an iPhone or Android smartphone\n If Car: Have a 2-door or 4-door car\n If Car: Have a valid driver’s licence in your name and proof of vehicle insurance\n\n Additional Information:\n If you have previous employment experience in transportation (such as a delivery driver, driver, professional driver, driving job, truck driver, heavy and tractor-trailer driver, cdl truck driver, class a or class b driver, local truck driver, company truck driver, taxi driver, taxi chauffeur, cab driver, cab chauffeur, taxi cab driver, transit bus driver, bus driver, coach bus driver, bus operator, shuttle driver, bus chauffeur) you might also consider delivering with Uber to earn extra money. We also welcome couriers who have worked with other peer-to-peer ridesharing or delivering networks. Couriers using the Uber platform come from all backgrounds and industries ranging from traditional driving and transportation industries to other industries. No professional delivering experience required. Delivering with Uber is a great way to supplement your part time or full time income.\n How to Sign Up\n 1) Click “Apply Now” and complete the sign up page.\n 2) Download the app and get started\n"
    },
    {
        "job_title": "Delivery Driver",
        "job_location": "Waterloo, ON",
        "job_salary": "$17 an hour",
        "job_description": "Our customer is the heart of our business. We are a retail community pharmacy looking for a mature driver with good customer service skills, good communicator and punctual to deliver medications to our clients.\nThe qualified person must provide a drivers abstract and will be required to drive within and outside town (1 hour radius).\nJob Types: Part-time, Permanent\nSalary: $17.00 per hour\nExpected hours: 10 – 20 per week\nSchedule:\n\nDay shift\nMonday to Friday\n\nWork Location: In person"
    },
    {
        "job_title": "Parts Advisor",
        "job_location": "XPart Supply Ltd. in Kitchener, ON",
        "job_salary": "$16.55 an hour",
        "job_description": "```Job Summary```\nWe are seeking a highly organized and customer-oriented Parts Advisor to join our team. As a Parts Advisor, you will be responsible for data entry and parts inventory counts. Your excellent communication skills and strong knowledge of automotive repair will be essential in providing exceptional customer service.\n```Responsibilities```\n- Assist customers in identifying and selecting the correct parts and accessories for their vehicles\n- Provide accurate and detailed information about available parts, pricing, and availability\n- Process customer orders and handle cash transactions\n- Maintain inventory levels and ensure proper organization of parts\n- Collaborate with the service department to ensure timely delivery of parts\n- Handle customer inquiries and resolve any issues or concerns promptly\n- Maintain a clean and organized parts department\n```Experience```\n- Proficient in using computer systems, including Excel, to manage inventory and process orders\n- Excellent sales and customer service skills\nIf you are a motivated individual with a passion for the parts industry and providing exceptional customer service, we encourage you to apply. Join our team as a Parts Advisor and contribute to our mission of delivering top-notch service to our valued customers.\nPlease note that only candidates located with in 30 min will be considered for this position.\nJob Type: Part-time\nSalary: $16.55 per hour\nExpected hours: 15 – 30 per week\nFlexible Language Requirement:\n\nFrench not required\n\nSchedule:\n\nMonday to Friday\n\nExperience:\n\nData entry: 1 year (required)\n\nWork Location: In person\nExpected start date: 2024-04-01"
    },
    {
        "job_title": "Part Time Dog Walker - weekdays",
        "job_location": "Guelph, ON",
        "job_salary": "$20–$24 an hour",
        "job_description": "Join our growing pack!\nWe are looking for ENTHUSIASTIC, SELF-MOTIVATED, and EAGER-TO-PLEASE individuals who have a love of animals and the outdoors. We go above and beyond for our clients and are looking for this in anyone new joining our team.\n* This is a part-time position, for about 10 hours a week.\n* It is for weekdays between approximately 11 a.m. and 3 p.m.\n* Walk dogs around another part time job, or your school schedule.\n* Start date would be around March 25th, with a few dogs, working up to more full time early-mid April.\n* We are only looking for someone who is interested in working for a minimum of six months (preferably longer!) and who lives in Guelph. Traveling from a nearby town is not a good fit.\n* Please include your AVAILABILITY and DOG HANDLING EXPERIENCE in your cover letter or send a message about it.Priority will be given to applicants who have training experience or who have worked with a variety of types of dogs, and pay will reflect experience and qualifications.\nRequirements- be available for 8-12 hours a week during the day time (11 a.m. and 3 p.m.)- have a reliable vehicle and a smartphone, taking the bus or biking is not an option.- be willing to drive around Guelph to get to clients homes.- have exceptional communication skills and be able to text / email clients after walks, send photos. Prompt communication with the office is essential.- have excellent time management skills and the ability to work independently.- be physically able to walk dogs of all sizes, in all types of weather. We work outside, walking in the heat, rain, and snow, for multiple hours a day.- be reliable, honest, and provide multiple references.- have a current police check, or be willing to get one upon hire.- have a sincere passion for, and significant knowledge of canines and canine behaviour.- at least one year working with or volunteering with dogs. This means more than just owning a family dog.\nJob Types: Part-time, Permanent, Casual\nSalary: $20.00-$24.00 per hour\nBenefits:\n\nCasual dress\n\nFlexible Language Requirement:\n\nFrench not required\n\nSchedule:\n\nDay shift\nMonday to Friday\n\nApplication question(s):\n\nDo you live in Guelph?\nPlease describe your availability.\nAre you looking a long term, part time job? We are only interested in applicants who are available for more than 6 months.\n\nExperience:\n\nDog handling: 1 year (required)\n\nLicence/Certification:\n\nDriving Licence and car (required)\n\nWork Location: In person\nExpected start date: 2024-04-01"
    },
    {
        "job_title": "Respiratory Therapist - Neonatal Intensive Care (Work in Hamilton)",
        "job_location": "Waterloo, ON",
        "job_salary": "$33.75–$46.62 an hour",
        "job_description": "Unit Summary\nStep into a job that opens countless doors. As Ontario’s most comprehensive healthcare system, and the only one in the province to provide care from pre-birth to end of life, we offer endless opportunities. You can explore advancement opportunities, take professional development courses, and stretch yourself as a leader, all at HHS.\nWe are the largest employer in the greater Hamilton region, and play a vital role in training the next generation of health professionals in collaboration with our academic partners, including McMaster University and Mohawk College. We are a world-renowned hospital for healthcare research, ranked fourth in Canada and we focus on improving the quality of care for our patients through innovation and evidence-based practices. Our multi-site hospital has over 1,100 beds and we offer world-leading expertise in many areas, including cardiac and stroke care, cancer care, palliative care and pediatrics. Open the door to a career that evolves with you. Start exploring opportunities now and join our team of over 15,000 dedicated staff, physicians, researchers and volunteers.\nMcMaster Children’s Hospital (MCH) has been providing care to children from across the region since 1988. Here, patients ranging in age from infancy to 17 benefit from a family-centred approach that prioritizes the child’s emotional, mental and physical well-being. The hospital is home to the fastest-growing kids-only emergency department in Ontario, one of Canada’s most advanced neonatal intensive care units, and a range of programs and clinics with unique expertise in a number of areas including children’s cancer, digestive diseases, and mental health.\nPosition Summary\nThe Neonatal Intensive Care Unit (NICU) at McMaster Children’s Hospital is comprised of a Level III NICU, a Level IIc nursery and a neonatal transport team, providing medical and surgical care to neonatal patients and their families. Our NICU serves a broad geographic area within southern Ontario. The interdisciplinary team provides family-centered care with a strong focus on evidence-based best practice and continuous quality improvement. McMaster NICU is also actively involved in a number of collaborative quality improvement initiatives provincially, nationally and internationally.\nOur NICU Registered Respiratory Therapists (RRTs) are assigned to the special care areas and are responsible for respiratory care in these areas. RRTs also provide education to nurses, other healthcare professionals and students throughout the unit. Other duties may be assigned, including but not limited to, such tasks as patient safety and quality improvement initiatives, committee work, and assisting in research.\nSchedule Work Hours\nRotating days, nights, weekends and holidays.\nQualifications\n\nGraduate of an accredited program in Respiratory Therapy\nCurrent Registration with the College of Respiratory Therapists of Ontario\nSuccessful Completion of the Canadian Board of Respiratory Care (CBRC) exam\nDemonstrated interpersonal, communication and teamwork skills\nCertified in Neonatal Resuscitation Provider (NRP)\nDemonstrated knowledge of ventilator requirements for the micro premature population\nDemonstrate the philosophy of Family Centered Care\nDemonstrate knowledge of developmental care\nWillingness to Precept respiratory therapy clinical students\nDemonstrated commitment to lifelong learning\nExperience, within the last 2 years, in a level 3 NICU is preferred\nExperience, within the last 2 years, attending high risk deliveries is preferred\n\nAs a condition of employment, you are required to submit proof of full COVID-19 vaccination to Employee Health Services.\nHamilton Health Sciences fosters a culture of patient and staff safety, whereby all employees are guided by our Mission, Vision, Values, and Values Based Code of Conduct. Hamilton Health Sciences is a teaching hospital and all staff and physicians are expected to support students and other learners.\nTo be considered for this opportunity applicants must apply during the posting period. All internal and external applicants may ONLY apply via the Careers website.\nHamilton Health Sciences is an equal opportunity employer and we will accommodate any needs under the Canadian Charter of Rights and Freedom, Accessibility for Ontarians with Disabilities Act and the Ontario Human Rights Code. Hiring processes will be modified to remove barriers to accommodate those with disabilities, if requested. Should any applicant require accommodation through the application processes, please contact HR Operations at 905-521-2100, Ext. 46947 for assistance. If the applicant requires a specific accommodation because of a disability during an interview, the applicant will need to advise the hiring manager when scheduling the interview and the appropriate accommodations can be made.\nThis competition is open to all qualified applicants, however, qualified internal applicants will be considered first. Past performance will be considered as part of the selection process. If you are a previous employee of Hamilton Health Sciences, please note: the circumstances around an employee's exit will be considered prior to an offer of employment\nProficiency in both Official Languages, French and English, is considered an asset\nIf this position is temporary, selection for this position will be as per the outlined Collective Agreements:\nArticle 30 (k), CUPE Collective Agreement\nArticle 10.7 (d), ONA Collective Agreement\nArticle 13.01 (b) (ii), OPSEU 273 Collective Agreement\nArticle 14.04, OPSEU 209 Collective Agreement\nArticle 2.07 and Article 13, PIPSC RT Collective Agreement\nJob Type: Part-time\nSalary: $33.75-$46.62 per hour\nBenefits:\n\nDental care\nEmployee assistance program\nExtended health care\nOn-site parking\nPaid time off\nVision care\n\nWork Location: In person"
    },
    {
        "job_title": "Emergency Registered Travel Nurse (RN) Opportunities for Yukon!",
        "job_location": "Ontario",
        "job_salary": "$85 an hour",
        "job_description": "We are immediately seeking Registered Travel Nurses (RNs) in the Yukon for Emergency Room (ER)!\nRequirements\n· Minimum 1 year paid work experience within the last 2 years\n· Active Registered Nursing License\n· Able to work effectively in a physically demanding environment including ability to lift and position patients\n· Demonstrates ability to understand, speak, read and write effectively in English\n· Excellent observation, communication, and critical thinking skills\n· Schedule flexibility\n· ACLS, CTAS\n· PALS, TNCC (preferred)\nWhat We Offer\n· $85 hourly rate\n· Daily per diems of $85 (for daily expenses)\n· Flights reimbursed\n· Accommodations included\n· Bi-weekly pay\n· License reimbursement (conditions apply)\n· Excellent Referral program\nWe offer a $100 Fast Start Bonus - For those who are credentialed and pick up 3 shifts within 7 calendar days of starting credentialing process + $250 referral bonus available (subject to conditions)!\nCall 403-356-9692 or email healthcarejobs.reddeerab@expresspros.com your Resume/Certifications for immediate application.\n#INDEHP\nJob Types: Full-time, Fixed term contract, CasualContract length: 6 weeks\nSalary: $85.00 per hour\nBenefits:\n\nOn-site parking\n\nFlexible Language Requirement:\n\nFrench not required\n\nSchedule:\n\nDay shift\nEvening shift\nMorning shift\nNight shift\nOvertime\n\nSupplemental pay types:\n\nOvertime pay\n\nApplication question(s):\n\nWilling to travel for 6 weeks at a time to the Yukon?\n\nEducation:\n\nBachelor's Degree (preferred)\n\nExperience:\n\nCanadian Registered Nurse: 1 year (required)\nEmergency Room: 1 year (required)\n\nLicence/Certification:\n\nCanadian Registered Nurse (RN) License (required)\n\nWork Location: In person"
    },
    {
        "job_title": "AZ Truck Driver",
        "job_location": "7 Grand Avenue, Kitchener, ON",
        "job_salary": "$50,000–$80,000 a year",
        "job_description": "Bell Cartage Ltd is a market leader in transportation logistics, as well as wholesale and retail transportation solutions. We have immediate openings for AZ Drivers for a full time opportunities! Our local drivers are paid hourly and home daily! Our long haul drivers are paid by percentage or per mile (drivers choice!) and have various work schedules available! Many of our cross border long haul drivers are earning above $2000.00 per week (paid on percentage). We offer our drivers above average wages and benefits. We have openings available in various divisions! We offer state of the art equipment and family atmosphere! Please call or email today to find out more!\nResponsibilities and qualifications associated with this role are as follows:\nAZ drivers license with flatbed 2 years experience required (no tarp freight available)\nClean drivers license and CVOR abstract\nAbility to complete required reports and paperwork\nClean criminal record check\nInterested persons should forward their resume complete with a current abstract of driving record and CVOR record along with a current police criminal record check to Bell Cartage.\nWork remotely\n\nNo\n\nJob Types: Full-time, Part-time, PermanentPart-time hours: 50 per week\nSalary: $50,000.00-$80,000.00 per year\nBenefits:\n\nCasual dress\nCompany events\nDental care\nDisability insurance\nExtended health care\nFlexible schedule\nLife insurance\nOn-site parking\nPaid time off\nVision care\n\nSchedule:\n\nDay shift\nMonday to Friday\nNight shift\n\nExperience:\n\nmanual transmission: 1 year (required)\ntruck driving: 2 years (required)\n"
    },
    {
        "job_title": "Medical Receptionist - Mat Leave Coverage",
        "job_location": "Dr. Ali in Guelph, ON",
        "job_salary": "Up to $19 an hour",
        "job_description": "Duties- Greet and check-in patients as they arrive at the medical office- Answer phone calls and schedule appointments for patients- Collect patient information and update electronic medical records- Verify insurance coverage and assist with billing inquiries- Maintain cleanliness and organization of the front desk area- Assist with administrative tasks such as filing, faxing, and scanning documents\nExperience- Previous experience working in an administrative or office setting- Familiarity with front desk operations in a medical office is preferred- Proficiency in using electronic medical records system, PSS and Ocean\nAs a Medical Receptionist, you will play a crucial role in ensuring the smooth operation of our medical office. Your friendly demeanor and excellent organizational skills will contribute to creating a positive experience for our patients.\nPlease note that this is not a remote position. The Medical Receptionist will be required to work on-site at our medical office. Our office is a dog friendly environment so applicants must be comfortable working with them.\nIf you have the necessary experience and skills to excel in this role, we invite you to apply. We offer competitive compensation.\nJoin our team of dedicated professionals and make a difference in the lives of our patients!\nJob Type: Part-time\nSalary: Up to $19.00 per hour\nSchedule:\n\nEvening shift\nMonday to Friday\nWeekends as needed\n\nApplication question(s):\n\nDo you like dogs?\n\nEducation:\n\nSecondary School (preferred)\n\nExperience:\n\nPSS: 1 year (preferred)\n\nWork Location: In person"
    },
    {
        "job_title": "Part-time Volunteer Coordinator, Orientation",
        "job_location": "299 Doon Valley Dr, Kitchener, ON",
        "job_salary": "$19.64–$22.51 an hour",
        "job_description": "\nRequisition Details \n\n\n\n\n\n\n\n\nJob Title: Part-time Volunteer Coordinator, Orientation \nRequisition #: 23-998 \nCampus: Doon \nDepartment: Student Engagement \nStarting Rate: $19.64 \nPayband Range: $19.64 - $22.51 \nHours/Week: Up to 24 hours \nPosting Date: Tuesday, March 19, 2024 \nClosing Date: Wednesday, March 27, 2024 at 11:59 PM EST \nVacancy Type: Support Staff - Part-time Temporary \n\n\n\n\n\n\n\n\n\nSupport Staff Temporary Part-time New Position (8 Month Contract)\nThe Volunteer Coordinator supports the Student Experience team with Volunteer Management for orientation and transition initiatives during peak times in the student lifecycle. The incumbent will support 250 to 400 student volunteers each term to welcome new students with their transition to studies at Conestoga College through Orientation and a variety of events and programs. The Coordinator assists in all parts of the volunteer management lifecycle including (1) needs assessment, (2) recruitment, (3) screening, (4) selection and scheduling, (5) onboarding and training, (6) retention and recognition, and (7) evaluation, in conjunction with the Orientation Coordinator and the team. In addition, the incumbent participates as an active member of the volunteer management committee within the Student Experience office to establish best practices for volunteer management across the department.\nSuccessful candidates will be required to conduct work within Ontario and must be available to work on campus as required. It is anticipated that this position will meet the needs of the department working fully on-site at the Doon campus. The candidate will work up to 24 hours per week, normally from 8:30 a.m. to 2:30 p.m., Monday to Thursday. Weekend and evening work may also be required to support student training and Orientation.\nResponsibilities:\n\nSurveys volunteer needs across each campus to meet volunteer targets\nRecruits, screens, schedules, and trains volunteers\nMaintains and updates volunteer lists\nDevelops retention and recognition opportunities\nCollects volunteer statistics for evaluation reports\nResponds and answers to volunteer inquiries\nProvides students and visitors with information and referrals during transition events and peak times in the student lifecycle\nParticipates in setting up, organizing, and tracking supplies and equipment for transition events\nShares the Conestoga student experience with prospective students and families virtually and in-person\nOther duties as assigned\n\n\n\nQualifications:\n\nOne-year certificate in Volunteer Management, Event Management, or a related field of study\nTwo years of practical work-related experience in volunteer management, orientation, and/or transition initiatives, preferably in a post-secondary setting\nKnowledge of Student Development, Co-curricular learning, Conestoga College campus, community, and student services would be considered an asset\nInterpersonal skills, written, and verbal communication skills\nOrganizational and time-management skills\nHigh degree of computer literacy, including proficiency in Microsoft Office Suite, data management skills, detail-oriented, information literacy, with the ability to use manuals, websites, and other resources to find specific information\n\n#LI-POST\n\n"
    },
    {
        "job_title": "Cook - Jacob's Grill",
        "job_location": "1398 King St N, St. Jacobs, ON",
        "job_salary": "$16.55–$18.00 an hour",
        "job_description": "Wage $17-18\nThe successful candidate is responsible for the preparation, plating and packaging of high quality, delicious foods for the restaurant, as well as preparing and organizing the service and shipment of takeout food, large batch prep items as well as day to day prep and kitchen cleaning. This person is dedicated to preparing items in a thoughtful manner, displaying exceptional culinary talents and playing a key role in surpassing customer expectations and providing a welcoming work environment in partnership with our team.\nWhat makes you the perfect candidate:\n\nYou enjoy working among positive and passionate individuals – we are a happy, hardworking team!\nYou love working in a fast-paced team environment.\nYou have a passion for the culinary arts and enjoy creating food, from scratch, that exceeds expectations.\nYou have at least one year experience working as a cook and are able to execute various culinary techniques.\nYou have a strong understanding and skill set in the realm of a commercial kitchen, understanding the different challenges and organizational skills required to deliver above customer expectations.\nYou would like a job with the opportunity for endless growth.\n\nRequirements\n· Ability to endure long hours standing and walking.\n· Able to work independently and efficiently.\n· Must be able to continually lift up to 50 lbs.\n· Ability to bend, twist, lift, and carry items for extended periods of time.\n· Act in accordance with all policies, procedures, dress code, and health and safety issues in accordance with OHSA, WSIB programs, fire regulations and health department requirements.\n· Must be able to work days, nights, weekends and holidays\nAdvantages to being part of the Jacob’s Grill team:\n\nDiscounts at all Stone Crock Inc. restaurants, stores and marketplace\nTraining and Development\nGrowth opportunities\nAmazing team and company culture!\n\nStone Crock Inc and affiliated companies, including Jacob’s Grill, accommodate the needs of job applicants throughout its recruitment and selection processes in accordance with the Ontario Human Rights Code and the Accessibility for Ontarians with Disabilities Act. Accommodation needs must be provided in advance. To discuss your needs, please contact the hiring manager.\nJob Types: Full-time, Part-time, Permanent\nBenefits:\n\nEmployee benefit program (full time employees only)\n\nSchedule:\n\nWeekdays/Weekends\nOccasional holidays\nDaytime and evening hours\nWeekend availability is required\n\nAbility to commute/relocate:\n\nSt. Jacobs, ON, N0B 2N0: reliably commute or plan to relocate before starting work\nPublic transportation to the Village does exist, but not all hours of the day\n\nExperience:\n\nCook: 1 year (preferred)\n\nJob Types: Full-time, Part-time, Permanent\nSalary: $16.55-$18.00 per hour\nBenefits:\n\nDiscounted or free food\nExtended health care\nOn-site parking\nStore discount\n\nSchedule:\n\n8 hour shift\nDay shift\nEvening shift\nHolidays\nMonday to Friday\nWeekends as needed\n\nSupplemental pay types:\n\nTips\n\nAbility to commute/relocate:\n\nSt. Jacobs, ON N0B 2N0: reliably commute or plan to relocate before starting work (required)\n\nLicence/Certification:\n\nFood Handler Certification (required)\n\nWork Location: In person"
    },
    {
        "job_title": "Immigration Law Clerk/Fingerprinting Technician",
        "job_location": "Pilkington Law Firm in Guelph, ON",
        "job_salary": "From $22 an hour",
        "job_description": "Immigration law clerk responsible for helping to prepare family immigration matters. Also required to provide fingerprinting services\nJob Types: Part-time, Permanent\nPay: From $22.00 per hour\nWork Location: In person"
    },
    {
        "job_title": "Superintendent - Fergus",
        "job_location": "CertiClean in Fergus, ON",
        "job_salary": "$19–$20 an hour",
        "job_description": "We are seeking a part-time Building Superintendent to oversee the efficient operation and maintenance of a building. The ideal candidate will be available on Monday - Fridays to fulfill the following responsibilities (Please be aware: there might be instances where emergencies or meetings require attendance outside of regular hours):\nResponsibilities:\n\nBring garbage and recycling bins to the curb for collection\nCoordinate on-site vendor inspections and repairs (approximately one to two per week)\nManage elevator reservations (typically once a month)\nArrange moving covers within elevators\nUpdate the intercom system as needed (instructions provided)\nServe as the emergency contact for fire and leaks (negotiations underway)\nPerform lawn cutting duties\nMaintain salt levels in the softener system\nFulfill additional tasks outlined in the contract\n\nAdditionally, the Superintendent will oversee the cleaning duties outlined in the existing contract, ensuring a high standard of cleanliness and maintenance throughout the building. This includes, but is not limited to:\nCleaning Duties:\n\nDusting furniture, tables, bookshelves, fireplaces, window sills, and heat registers\nSweeping and washing entry area floors as needed\nCleaning stairs, elevator, garbage rooms, and frequently touched surfaces\nChecking and cleaning washrooms\nDusting picture frames and wiping handrails on rotation\nSweeping basements twice per year\n\nSeasonal Patio and Entrance Maintenance:\n\nSetting up and storing patio furniture and cushions\nWashing patio furniture and glass barriers\nMaintaining rain barrels\nRemoving cobwebs, spiders, and bird dirt from patio areas\nArranging furniture and sweeping entrance areas beneath overhangs\n\nAdditional Periodic Tasks:\n\nCleaning windows inside and out\nSpot cleaning carpets\nWiping pictures, interior furniture, and light fixtures\nSweeping larger concrete areas and exterior stairs\n\nThe Building Superintendent will play a crucial role in ensuring the overall cleanliness, safety, and functionality of the building for its residents and visitors. Strong attention to detail, organization, and communication skills are essential for success in this role.\nJob Type: Part-time\nSalary: $19.00-$20.00 per hour\nExpected hours: 25 – 35 per week\nSchedule:\n\nMonday to Friday\n\nAbility to Commute:\n\nFergus, ON N1M 3V7 (required)\n\nWork Location: In person\nExpected start date: 2024-04-01"
    },
    {
        "job_title": "Part Time School Bus Driver",
        "job_location": "Breslau, ON",
        "job_salary": "$21.45 an hour",
        "job_description": "No Experience? Love to Drive? Enjoy Working with Children? Need a Flexible Part-Time Schedule?\nIf you answered Yes, to any of these questions, then Student Transportation of Canada might be the right place for you!\nElliott Coach Lines, a division of Student Transportation of Canada is looking for new and experienced School Bus Drivers. If you have a Class-B license, great! If you need help to get your Class-B, we will train you for FREE!!!!!\nWhat we Offer:\n\n$21.45/hour\nFree license upgrades\nMonday to Friday schedule\nHolidays and Summer off\nPart-Time, Flexible Employment (15-20 hours per week)\nMake a positive difference in the lives of local children\nBring your child on board, get paid and save on daycare!\n\nWhat do School Bus Drivers do???\nIt's pretty simple, in the morning we pick up school aged passengers from predetermined locations and then deliver them to school. In the afternoon, we do the exact same thing, just in reverse order; we take them from school back home (once again at predetermined locations).\nSchool Bus Drivers operate Monday - Friday, from September until the end of June...that's right, summers off. Depending upon your specific route, you could work anywhere from 7am -9:30am then again in the afternoon from about 2pm - 4pm.\nWho can do this job???\nAs long as you are responsible adult and have at least a 'Class-G' drivers license, we can teach you how...for FREE!!!\n\nLooking for extra income?\nRecently retired?\nUber/Lyft/Cab experience?\nor just curious...?\n\nContact us today to get started\nStudent Transportation of Canada is proud to be an equal opportunity employer. If you require a disability related accommodation to take part in our interview and selection process, or have any questions please reach out directly to a member of our Recruitment Team.\n#parttime #schoolbusdriver #driver #schoolbus\nJob Type: Part-time\nSalary: $21.45 per hour\nSchedule:\n\nDay shift\nMonday to Friday\nNo weekends\n\nWork Location: In person"
    },
    {
        "job_title": "Deliver Eats with Uber Eats",
        "job_location": "Guelph, ON",
        "job_salary": "Part-time",
        "job_description": "\nYour Schedule. Your Goals. Start Delivering with Uber.\n What is Uber?\n Delivering with Uber is an alternative to a part-time or full-time job and can get you earning cash quickly. Delivering with Uber allows you to earn quick cash while maintaining the flexibility your schedule requires (gig, part-time, full-time, seasonal, hourly, or temporary).\n Why Drive With Uber?:\n\n Receive your earnings fast: Your earnings are automatically transferred to your bank account every week.\n You are your own boss: You decide how much or little you want to drive and earn. \nGrab your car, bike, or by foot and deliver with Uber whenever you want—for an hour, a weekend, or throughout the week. \nSigning up only takes a few minutes: We'll provide support along the way and get you on the platform as soon as we can.\n Keep 100% of your tips.\n\n Requirements to Drive:\n\n Meet the minimum age to deliver in your city \nProof of work eligibility: Can be a Canadian Passport, Study or Work permit, Canadian Birth Certificate, Permanent Resident or Citizenship Card\n You consent to a background check\n You have an iPhone or Android smartphone\n If Car: Have a 2-door or 4-door car\n If Car: Have a valid driver’s licence in your name and proof of vehicle insurance\n\n Additional Information:\n If you have previous employment experience in transportation (such as a delivery driver, driver, professional driver, driving job, truck driver, heavy and tractor-trailer driver, cdl truck driver, class a or class b driver, local truck driver, company truck driver, taxi driver, taxi chauffeur, cab driver, cab chauffeur, taxi cab driver, transit bus driver, bus driver, coach bus driver, bus operator, shuttle driver, bus chauffeur) you might also consider delivering with Uber to earn extra money. We also welcome couriers who have worked with other peer-to-peer ridesharing or delivering networks. Couriers using the Uber platform come from all backgrounds and industries ranging from traditional driving and transportation industries to other industries. No professional delivering experience required. Delivering with Uber is a great way to supplement your part time or full time income.\n How to Sign Up\n 1) Click “Apply Now” and complete the sign up page.\n 2) Download the app and get started\n"
    },
    {
        "job_title": "Delivery Driver - Flexible Schedule",
        "job_location": "Guelph, ON",
        "job_salary": "Part-time",
        "job_description": "\nYour Schedule. Your Goals. Start Delivering with Uber.\n What is Uber?\n Delivering with Uber is an alternative to a part-time or full-time job and can get you earning cash quickly. Delivering with Uber allows you to earn quick cash while maintaining the flexibility your schedule requires (gig, part-time, full-time, seasonal, hourly, or temporary).\n Why Drive With Uber?:\n\n Receive your earnings fast: Your earnings are automatically transferred to your bank account every week.\n You are your own boss: You decide how much or little you want to drive and earn. \nGrab your car, bike, or by foot and deliver with Uber whenever you want—for an hour, a weekend, or throughout the week. \nSigning up only takes a few minutes: We'll provide support along the way and get you on the platform as soon as we can.\n Keep 100% of your tips.\n\n Requirements to Drive:\n\n Meet the minimum age to deliver in your city \nProof of work eligibility: Can be a Canadian Passport, Study or Work permit, Canadian Birth Certificate, Permanent Resident or Citizenship Card\n You consent to a background check\n You have an iPhone or Android smartphone\n If Car: Have a 2-door or 4-door car\n If Car: Have a valid driver’s licence in your name and proof of vehicle insurance\n\n Additional Information:\n If you have previous employment experience in transportation (such as a delivery driver, driver, professional driver, driving job, truck driver, heavy and tractor-trailer driver, cdl truck driver, class a or class b driver, local truck driver, company truck driver, taxi driver, taxi chauffeur, cab driver, cab chauffeur, taxi cab driver, transit bus driver, bus driver, coach bus driver, bus operator, shuttle driver, bus chauffeur) you might also consider delivering with Uber to earn extra money. We also welcome couriers who have worked with other peer-to-peer ridesharing or delivering networks. Couriers using the Uber platform come from all backgrounds and industries ranging from traditional driving and transportation industries to other industries. No professional delivering experience required. Delivering with Uber is a great way to supplement your part time or full time income.\n How to Sign Up\n 1) Click “Apply Now” and complete the sign up page.\n 2) Download the app and get started\n"
    },
    {
        "job_title": "New Drivers: Earn a $250 bonus for 25 rides in 30 days",
        "job_location": "Cambridge, ON",
        "job_salary": "Part-time",
        "job_description": "\nNew drivers in Kitchener-Waterloo earn a CA$250 bonus for 25 rides in 30 days. Terms apply.\nDrive with Lyft and discover bonuses, pay transparency, and new roads to earning income.\n\nWhat is Lyft?\nLyft is a flexible earning opportunity and a platform that connects drivers with individuals that need rides. Driving with Lyft is the perfect way to earn money on any schedule and is a great alternative to part-time, full-time and seasonal opportunities. Drivers can cash out any time with Express Pay. Drivers enjoy flexibility with no hourly requirement. \nWhy Lyft?\n\nBoost Your Earnings: With Upfront Pay you can view the fare for a ride before you accept it, giving you more control of your earnings. Plus, you keep 100% of your tips. \nBe Your Own Boss: Set your own schedule and keep control over when you drive and earn\n\nDriver Requirements\n\nYou're at least 25 years old\nValid driver’s licence\nAny smartphone that can download and run the Lyft Driver app\nPass an annual driver screening, which reviews your driving history and criminal background check\nYou have a 4-door from 2014 or newer\n\nIn-Province license required for Ontario and Alberta. British Columbia driver’s license must be Class 1, 2, or 4.\n\n\nCar year may vary by region\n\n\nDoes not apply if you are renting a car through Express Drive program\n\n\n\nAdditional information\nYou might consider driving with Lyft to earn extra money, driving with Lyft is a great way to supplement your part time or full time income. No experience is needed, but you may be a great fit if you have experience in the transportation industry such as a delivery driver, professional driver, truck driver, taxi driver or cab driver.\n"
    }
]